cntranslate = {
  translator: "",
  contact   : "",
  language  : "ja-JP(日本語)",

  gui: {
    "Stat" : "ステータス",
    "Value": "基礎値",
    "Mod"  : "強化値",
    "Total": "合計値",

    "Base Stats"    : "基本ステータス",
    "Advanced Stats": "高級ステータス",
    "Buffs"         : "バフ",
    "Elemental Type": "元素ステータス",
    "Damage"        : "ダメージ",

    "Character"  : "キャラクター",
    "Artifacts"  : "聖遺物",
    "Party Buffs": "チーム",
    "Advanced"   : "詳細設定",
    "Help"       : "ヘルプ",
    "UI"         : "UI設定",

    "Optimizer"             : "最適化設定",
    "Target"                : "対象",
    "Auto Equip"            : "最適を自動装備",
    "Show Value of Substats": "聖遺物サブ効果の影響を表示",
    "Optimize Weapon"       : "武器を最適化",

    "Artifact"                           : "聖遺物",
    "Optimize Artifact Mainstat"         : "聖遺物メイン効果を最適化",
    "Optimize Substats"                  : "聖遺物サブ効果を最適化",
    "Optimize From Storage"              : "ストレージから最適化",
    "Optimize All Artifacts From Storage": "すべての聖遺物をストレージから最適化",
    "Optimize Set Effects"               : "聖遺物セット効果を最適化",
    "Flower"                             : "生の花",
    "Feather"                            : "死の羽",
    "Clock"                              : "時の砂",
    "Goblet"                             : "空の杯",
    "Circlet"                            : "理の冠",
    "Constellation"                      : "命ノ星座",
    "Lvl"                                : "Lv.",
    "Attack Lvl"                         : "通常攻撃 Lv.",
    "Skill Lvl"                          : "元素スキル Lv.",
    "Burst Lvl"                          : "元素爆発 Lv.",
    "20 Ascended"                        : "20突破",
    "40 Ascended"                        : "40突破",
    "50 Ascended"                        : "50突破",
    "60 Ascended"                        : "60突破",
    "70 Ascended"                        : "70突破",
    "80 Ascended"                        : "80突破",

    "Weapon"     : "武器",
    "Refine"     : "精錬ランク",
    "Wep Attack" : "基礎攻撃力",
    "Wep Substat": "サブ効果",

    "Enemy Modifiers": "Enemy Modifiers",
    "Use Enemy Calc" : "Use Enemy Calc",
    "Affected by"    : "敵が影響を受けている元素",
    "Enemy Lvl"      : "敵 Lv.",
    "Enemy Res"      : "敵 耐性（%）",

    "Elemental Resonance"            : "元素共鳴",
    "Elemental Reaction"             : "元素反応",
    "Party Member Abilities"         : "チームメンバー",
    "Artifact Buffs"                 : "聖遺物",
    "Weapon Buffs"                   : "武器",
    "Manual Input Buffs / Food Buffs": "Manual Input Buffs / Food Buffs",
    "Manually Input Buffs"           : "Manually Input Buffs",
    "Add Buff"                       : "Add Buff",
    "Apply Buffs"                    : "Apply Buffs",

    "Reaction Mode"                      : "Reaction Mode",
    "% -- Elemental Reaction Proc Chance": "% -- Elemental Reaction Proc Chance",
    "Switch to"                          : "Switch to",

    "Skill"         : "元素スキル",
    "Burst"         : "元素爆発",
    "Passives"      : "固有天賦",
    "Constellations": "命ノ星座",

    "Default"            : "Default",
    "Hit Type"           : " ",
    "Non-crit"           : "通常時",
    "Crit"               : "会心時",
    "Average"            : "平均",
    "DPS"                : "DPS",
    "Normal Attack"      : "通常攻撃",
    "Bonus Hits"         : "武器",
    "Elemental Reactions": "元素反応",
    "Skill"              : "元素スキル",
    "Burst"              : "元素爆発",
    "Passives"           : "固有天賦",
    "Constellations"     : "命ノ星座",
    "Artifact Effects"   : "聖遺物セット効果",
    "Reactionless"       : "Reactionless",
    "W/ Reaction"        : "W/ Reaction",

    "Hit-1"          : "1段ダメージ",
    "Hit-2"          : "2段ダメージ",
    "Hit-3"          : "3段ダメージ",
    "Hit-4"          : "4段ダメージ",
    "Hit-5"          : "5段ダメージ",
    "Hit-6"          : "6段ダメージ",
    "Charge Attack 1": "重撃1段ダメージ",
    "Charge Attack 2": "重撃2段ダメージ",
    "Plunge"         : "落下期間のダメージ",
    "Low Plunge"     : "低空落下攻撃ダメージ",
    "High Plunge"    : "高空落下攻撃ダメージ",

    "DPS"      : "DPS",
    "Total DPS": "DPS+武器の追加DPS",

    "Wep Bonus Hit" : "武器の追加ダメージ",
    "Proc Frequency": "発動間隔（秒）",
    "Bonus DPS"     : "武器の追加DPS",

    "Electrocharged": "感電",
    "Overloaded"    : "過負荷",
    "Superconduct"  : "超電導",
    "Pyro Swirl"    : "拡散（炎）",
    "Hydro Swirl"   : "拡散（水）",
    "Electro Swirl" : "拡散（雷）",
    "Cryo Swirl"    : "拡散（氷）",
    "Shattered"     : "氷砕き",
    "Vaporize"      : "蒸発",
    "Melt"          : "融解",
    "Crystallize"   : "結晶",

    "None": "なし",

    "Pyro"    : "炎",
    "Hydro"   : "水",
    "Dendro"  : "草",
    "Electro" : "雷",
    "Anemo"   : "風",
    "Cryo"    : "氷",
    "Geo"     : "岩",
    "Physical": "物理",
    "Frozen"  : "凍結",

    "Save as"                        : "Save as",
    "Save"                           : "Save",
    "Saved Builds"                   : "Saved Builds",
    "Share your build in Slot"       : "Share your build in Slot",
    "Share Build without Description": "Share Build without Description",
    "Share Build"                    : "Share Build",

    "Legacy"                          : "伝承（竜殺しの英傑譚）",
    "Wolfish Tracker"                 : "狼のような狩人（狼の末路）",
    "Remove"                          : "Remove",
    "Marginal benefit of each Stat to": "Marginal benefit of each Stat to ",
    "Key"                             : "Key",
    "Max Roll"                        : "Max Roll",
    "Min Roll"                        : "Min Roll",
    "Open Artifact Storage"           : "Open Artifact Storage",
    "Refresh Artifact Storage"        : "Refresh Artifact Storage",
    "Save Artifact As"                : "Save Artifact As",
    "Load Artifact"                   : "Load Artifact",
    "Copy to Empty Slot"              : "Copy to Empty Slot",
    "Delete Slot"                     : "Delete Slot",
    "Save As"                         : "Save As",
    "Load Build"                      : "Load Build",
    "Max"                             : "Max",
  },

  statTypes: {
    "HP"                   : "HP",
    "ATK"                  : "攻撃力",
    "DEF"                  : "防御力",
    "ElementalMastery"     : "元素熟知",
    "Elemental Mastery"    : "元素熟知",
    "Stamina"              : "スタミナ上限",
    "CritRate"             : "会心率",
    "Crit %"               : "会心率",
    "Critical Rate"        : "会心率",
    "CritDMG"              : "会心ダメージ",
    "Crit DMG"             : "会心ダメージ",
    "Critical Damage"      : "会心ダメージ",
    "Heal"                 : "与える治療効果",
    "Healing Bonus"        : "与える治療効果",
    "IncomingHeal"         : "受ける治療効果",
    "EnergyRecharge"       : "元素チャージ効率",
    "Energy Recharge"      : "元素チャージ効率",
    "ReduceCD"             : "クールタイム短縮",
    "PowerfulShield"       : "シールド強化",
    "PyroDMG"              : "炎元素ダメージ",
    "PyroRES"              : "炎元素耐性",
    "HydroDMG"             : "水元素ダメージ",
    "HydroRES"             : "水元素耐性",
    "DendroDMG"            : "草元素ダメージ",
    "DendroRES"            : "草元素耐性",
    "ElectroDMG"           : "雷元素ダメージ",
    "ElectroRES"           : "雷元素耐性",
    "AnemoDMG"             : "風元素ダメージ",
    "AnemoRES"             : "風元素耐性",
    "CryoDMG"              : "氷元素ダメージ",
    "CryoRES"              : "氷元素耐性",
    "GeoDMG"               : "岩元素ダメージ",
    "GeoRES"               : "岩元素耐性",
    "PhysicalDMG"          : "物理ダメージ",
    "PhysicalRES"          : "物理耐性",
    "Pyro Damage"          : "炎元素ダメージ",
    "Hydro Damage"         : "水元素ダメージ",
    "Dendro Damage"        : "草元素ダメージ",
    "Electro Damage"       : "雷元素ダメージ",
    "Anemo Damage"         : "風元素ダメージ",
    "Cryo Damage"          : "氷元素ダメージ",
    "Geo Damage"           : "岩元素ダメージ",
    "Physical Damage"      : "物理ダメージ",
    "HPPercent"            : "HP %",
    "ATKPercent"           : "攻撃力 %",
    "DEFPercent"           : "防御力 %",
    "HP %"                 : "HP %",
    "ATK %"                : "攻撃力 %",
    "DEF %"                : "防御力 %",
    "AttackSpeed"          : "攻撃速度",
    "AllDMG"               : "与えるダメージ",
    "NormalAttackDMG"      : "通常攻撃ダメージ",
    "ChargedAttackDMG"     : "重撃ダメージ",
    "ChargedAttackCritRate": "重撃の会心率",
    "PlungingDMG"          : "落下攻撃ダメージ",
    "ElementalSkillDMG"    : "元素スキルダメージ",
    "ElementalBurstDMG"    : "元素爆発ダメージ",
    "SwirlDMG"             : "拡散ダメージ",
    "OverloadedDMG"        : "過負荷ダメージ",
    "ElectrochargedDMG"    : "感電ダメージ",
    "SuperconductDMG"      : "超電導ダメージ",
    "BurningDMG"           : "燃焼ダメージ",
    "VaporizeDMG"          : "蒸発ダメージ",
    "MeltDMG"              : "融解ダメージ",
    "Elemental DMG"        : "元素ダメージ"
  },

  characterData: {
    "Amber"           : "アンバー",
    "Fischl"          : "フィッシュル",
    "Diona"           : "ディオナ",
    "Venti"           : "ウェンティ",
    "Tartaglia"       : "タルタリヤ",
    "Ganyu"           : "甘雨",
    "Beidou"          : "北斗",
    "Chongyun"        : "重雲",
    "Diluc"           : "ディルック",
    "Noelle"          : "ノエル",
    "Razor"           : "レザー",
    "Xinyan"          : "辛炎",
    "Bennett"         : "ベネット",
    "Jean"            : "ジン",
    "Kaeya"           : "ガイア",
    "Keqing"          : "刻晴",
    "Qiqi"            : "七七",
    "Traveler (Anemo)": "旅人（風）",
    "Traveler (Geo)"  : "旅人（岩）",
    "Xingqiu"         : "行秋",
    "Albedo"          : "アルベド",
    "Ayaka"           : "神里綾華",
    "Xiangling"       : "香菱",
    "Zhongli"         : "鍾離",
    "Xiao"            : "魈",
    "Rosaria"         : "ロサリア",
    "Barbara"         : "バーバラ",
    "Klee"            : "クレー",
    "Lisa"            : "リサ",
    "Mona"            : "モナ",
    "Ningguang"       : "凝光",
    "Sucrose"         : "スクロース",
    "Hutao"           : "胡桃"
  },

  talentData: {
    // アンバー
    "Amber": {
      constellations: [
        {
          name     : "一挙双擒!",
          desc     : "狙い撃ちする時、矢を連続で2本放つ。2本目の矢は元の矢の20%のダメージを与える。",
          calcStats: [
            {
              stat: "2本目の矢のダメージ"
            },
            {
              stat: "2本目の矢のダメージ（フルチャージ）"
            }
          ]
        },
        {
          name: "一触即発",
          desc: "ウサギ伯爵が改良された!フルチャージの狙い撃ちがウサギ伯爵の足に命中するとウサギ伯爵を直接起爆させることができる。この方法で自らウサギ伯爵を起爆した場合、追加で200%のダメージを与える。"
        },
        {
          name: "燃やせ!",
          desc: "矢の雨のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "ただの人形じゃない",
          desc: "爆弾人形のクールタイム-20%、使用可能回数+1。"
        },
        {
          name: "ウサギ伯爵だよ!",
          desc: "爆弾人形のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "野火の如く",
          desc: "矢の雨を発動した10秒間、チーム全員の移動速度+15%、攻撃力+15%。"
        }
      ],
      passives      : [
        {
          name: "百発百中!",
          desc: "矢の雨の会心率+10%、影響範囲+30%。",
        },
        {
          name: "制圧射撃",
          desc: "狙い撃ちが弱点に命中すると、攻撃力+15%、継続時間10秒。"
        }
      ],
      skill         :
        {
          name     : "爆弾人形",
          desc     : `
ウサギ伯爵
・周囲の敵を挑発し、攻撃を引き付ける。耐久度はアンバーのHP上限によって決まる。
・破壊された時または継続時間が終了したときに爆発し、炎元素範囲ダメージを与える。

長押し
投擲方向を調整できる。投擲距離は長押しする時間によって増加する。`,
          calcStats: [
            {
              stat: "HP継承" // 公式
            },
            {
              stat: "爆発ダメージ" // 公式
            },
            {
              stat: "直接起爆ダメージ"
            }

          ]
        },
      burst         :
        {
          name     : "矢の雨",
          desc     : "前方に炎の矢の雨を放ち、炎元素範囲ダメージを持続的に与える。",
          calcStats: [
            {
              stat: "矢の雨1回のダメージ" // 公式
            },
            {
              stat: "矢の雨の合計ダメージ" // 公式
            },
            {
              stat: "矢の雨の合計DPS"
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // バーバラ
    "Barbara": {
      constellations: [
        {
          name: "虹色の歌",
          desc: "10秒毎に元素エネルギーを1回復する。"
        },
        {
          name: "元気溌剌",
          desc: "公演、開始♪のクールタイム-15%。スキル継続中、出場している自身のキャラクターの与える水元素ダメージ+15%。"
        },
        {
          name: "明日の星",
          desc: "シャイニングミラクル♪のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "努力が魔法なの",
          desc: "重撃が敵に命中する度に、バーバラの元素エネルギーが1回復する。一回で最大元素エネルギーが5まで回復できる。"
        },
        {
          name: "純真な絆",
          desc: "公演、開始♪のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "美しいものをあなたに",
          desc: `
バーバラ待機中に出場している自身のキャラクターが戦闘不能になると、下記の効果が発動される:
・戦闘不能になったキャラクターを復活させる。
・該当キャラクターのHPが100%回復される。
この効果は15分毎に1回のみ発動可能。`
        }
      ],
      passives      : [
        {
          name: "輝く季節",
          desc: "公演、開始♪歌声の輪が継続している間、スタミナ消費-12%。"
        },
        {
          name: "アンコール",
          desc: "出場している自身のキャラクターが元素オーブまたは元素粒子を獲得した時、公演、開始♪の歌声の輪の継続時間+1秒。この方法で最大5秒まで延長可能。"
        }
      ],
      skill         :
        {
          name     : "公演、開始♪",
          desc     : `
躍動する歌声のような水の玉を召喚し、歌声の輪を作って周囲の敵に水元素ダメージを与え、さらに湿潤状態を付与する。

歌声の輪
・バーバラの通常攻撃が命中した時、チーム内の自身のキャラクター全員または付近の味方のHPを回復する。回復量はバーバラのHP上限によって決まる。
・重撃が命中した時、回復量は4倍になる。
・一定時間の間隔で、出場している自身のキャラクターのHPを回復する。
・キャラクター、または接触した敵に湿潤状態を付与する。`,
          calcStats: [
            {
              stat: "命中回復量" // 公式
            },
            {
              stat: "継続回復量" // 公式
            },
            {
              stat: "水玉ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "シャイニングミラクル♪",
          desc     : "周囲にいる味方とチーム内の自身のキャラクター全員のHPを大量に回復する、回復量はバーバラのHP上限を基準とする。",
          calcStats: [
            {
              stat: "回復量" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 北斗
    "Beidou": {
      constellations: [
        {
          name: "四方に沈む魚龍",
          desc: "雷斫り発動時: HP上限16%分のシールドを15秒間発動する。該当シールドは雷元素ダメージに対して250%の吸収効果がある。"
        },
        {
          name: "沸き上がる雷",
          desc: "雷斫りの稲妻が2体の敵を追加で攻撃可能になる。"
        },
        {
          name: "雷引きの潮",
          desc: "浪追いのスキルLv.+3。最大15Lv.まで。"
        },
        {
          name     : "星に導かれた岸線",
          desc     : "攻撃を受けた後の10秒間、北斗の通常攻撃に追加で20%の雷元素ダメージが付与される。",
          calcStats: [
            {
              stat: "星に導かれた岸線ダメージ"
            },
            {
              stat: "星に導かれた岸線DPS"
            }
          ]
        },
        {
          name: "白波に映る霞光",
          desc: "雷斫りのスキルLv.+3。最大15Lv.まで。"
        },
        {
          name: "北斗の祓い",
          desc: "雷斫り継続中、周囲の敵の雷元素耐性-15%。"
        }
      ],
      passives      : [
        {
          name: "完全なる霊光",
          desc: "攻撃された瞬間に発動した浪追いの反撃は最大ダメージアップ効果を得る。"
        },
        {
          name: "満天の霹靂",
          desc: `
最大ダメージアップ効果のある浪追いを発動した後の10秒間、下記の効果が発動される:
・通常攻撃と重撃の攻撃速度+15%、攻撃ダメージ+15%。
・重撃に必要な時間が大幅に減少する。`
        }
      ],
      skill         :
        {
          name     : "浪追い",
          desc     : `
一回押し
雷の力を凝集させ、前方に大剣を振り、雷元素ダメージを与える。

長押し
武器をシールドとして使う、ダメージ吸収量は北斗のHP上限によって決まる。
手を放すまたはスキル継続時間終了時、大剣を振り回して攻撃を行い、雷元素ダメージを与える。スキル期間中に受けた攻撃の回数により、与えるダメージを最大2回までアップさせる。
シールドには下記の効果がある:
・雷元素ダメージに対して250%の吸収効果がある。
・スキル発動時、北斗に雷元素付着効果を付与する。`,
          calcStats: [
            {
              stat: "シールド吸収量" // 公式
            },
            {
              stat: "元素スキル基礎ダメージ" // 公式「基礎ダメージ」
            },
            {
              stat: "被撃時ダメージアップ" // 公式
            },
            {
              stat: "元素スキル最大ダメージ"
            }
          ]
        },
      burst         :
        {
          name     : "雷斫り",
          desc     : `
巨獣海山との戦いを思い出した北斗は、巨獣と雷電の力を召喚し、雷獣の盾を作り、周囲の敵に雷元素ダメージを与える。

雷獣の盾
・通常攻撃と重撃が近距離の敵に命中すると、雷の力で敵の間を跳躍する稲妻を発生させ、敵に雷元素ダメージを与える。
・キャラクターの中断耐性をアップさせ、受けるダメージを軽減する。

稲妻発生の効果は一秒に1回のみ。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "稲妻ダメージ" // 公式
            },
            {
              stat: "ダメージ軽減" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ベネット
    "Bennett": {
      constellations: [
        {
          name: "冒険の憧れ",
          desc: "素晴らしい旅の攻撃力アップ効果のHPによる制限がなくなり、更にベネットの基礎攻撃力の20%に当たる数値を追加する。"
        },
        {
          name: "絶境踏破",
          desc: "HPが70%以下になると、元素チャージ効率+30%。"
        },
        {
          name: "炎のような情熱",
          desc: "溢れる情熱のスキルLv.3、最大Lv.15まで。"
        },
        {
          name: "消えない情熱",
          desc: "1段チャージ溢れる情熱を発動する時、二段目攻撃中に通常攻撃をすると追加攻撃を発動できる。二段目攻撃の135%の追加ダメージを与える。"
        },
        {
          name: "開拓の心意気",
          desc: "素晴らしい旅のスキルLv.3、最大Lv.15まで。"
        },
        {
          name: "烈火と勇気",
          desc: "素晴らしい旅エリア内にいる片手剣、両手剣、長柄武器キャラクターの炎元素ダメージ+15%、さらに炎元素付与状態を獲得する。"
        }
      ],
      passives      : [
        {
          name: "情熱復活",
          desc: "溢れる情熱のクールタイム-20%。"
        },
        {
          name: "恐れなき熱血",
          desc: `
素晴らしい旅エリア内にいると、溢れる情熱が以下の効果を持つ。
・クールタイム-50%。
・2段チャージによるベネット自身のノックバックが発生しない。`
        }
      ],
      skill         :
        {
          name     : "溢れる情熱",
          desc     : `
一回押し
前方に素早く炎の一撃を仕掛け、炎元素ダメージを与える。

長押し
長押しでチャージし、チャージ段数により効果が変わる。
・1段チャージ: 二段攻撃を仕掛け、炎元素ダメージを与え、敵をノックバックする。
・2段チャージ: 三段攻撃を発動し、大量の炎元素ダメージを与え、最後の一撃に爆発が発生し、自身と敵を同時にノックバックする。ベネットがノックバックされた時に、ダメージを受けることはない。`,
          calcStats: [
            {
              stat: "一回押しダメージ" // 公式
            },
            {
              stat: "1段チャージダメージ" // 公式
            },
            {
              stat: "2段チャージダメージ" // 公式
            },
            {
              stat: "爆発ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "素晴らしい旅",
          desc     : `
ジャンプして地面を叩き、炎元素ダメージを与え、鼓舞エリアを生成する。

鼓舞エリア
･エリア内のキャラクターのHPが70%以下の場合、HPが持続的に回復する。回復量はベネットのHP上限によって決まる。
･エリア内のキャラクターのHPが70%を超えている場合、ベネットの基礎攻撃力を基準に、一定割合の攻撃力がアップする。
･エリア内のキャラクターに炎元素付着効果を付与する。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "継続回復" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 重雲
    "Chongyun": {
      constellations: [
        {
          name     : "釈凌詠氷",
          desc     : "通常攻撃の最後の一撃が前方に3つの氷の刃を放ち、経路上の敵に重雲の攻撃力50%分の氷元素ダメージを与える。",
          calcStats: [
            {
              stat: "氷の刃ダメージ"
            }
          ]
        },
        {
          name: "周天の回転",
          desc: "霊刃・重華積霜エリア内で発動した元素スキルと元素爆発のクールタイムが-15%。"
        },
        {
          name: "雲の果てに光あり",
          desc: "霊刃・雲開星落のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "浮雲霜天",
          desc: "重雲の攻撃が氷元素の影響を受けた敵に命中した時、自身の元素エネルギーを1回復する。この効果は2秒毎に1回のみ発動可能。"
        },
        {
          name: "真道の正理",
          desc: "霊刃・重華積霜のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "四霊の捧げ",
          desc: "HPの割合が重雲より低い敵に霊刃・雲開星落が命中した時、ダメージ+15%。また、スキル発動時さらに追加で霊刃を1本を召喚する。",
        }
      ],
      passives      : [
        {
          name: "吐納真定",
          desc: "霊刃・重華積霜エリア内にいる時、片手剣、両手剣、長柄武器キャラクターの通常攻撃の攻撃速度+8%。"
        },
        {
          name     : "追氷剣訣",
          desc     : "霊刃・重華積霜エリアが消えた時、自動的に付近の敵を攻撃する霊刃を召喚し、霊刃・重華積霜のスキルダメージ100%分の氷元素範囲ダメージを与える。命中した敵の氷元素耐性-10%、継続時間8秒。",
          calcStats: [
            {
              stat: "霊刃ダメージ"
            }
          ]
        }
      ],
      skill         :
        {
          name     : "霊刃・重華積霜",
          desc     : `
巨大な剣を振って地面を叩き、前方の円形範囲内に氷爆を起こし、敵に氷元素ダメージを与える。
その後、氷爆による寒気が重華積霜エリアになり、エリア内の片手剣、両手剣、長柄武器キャラクターは氷元素付与を獲得する。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "霊刃・雲開星落",
          desc     : `
印を結び、前方の空中に3本の巨大霊刃を召喚する。霊刃は短時間内に1本ずつ地面に落ちて爆裂する。
霊刃が爆裂する時、氷元素範囲ダメージを与え、敵を吹き飛ばす。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ディルック
    "Diluc": {
      constellations: [
        {
          name: "罪の裁断",
          desc: "HPが50%より上回る敵に対して、ディルックの与えるダメージ+15%。"
        },
        {
          name: "灼熱余燼",
          desc: "ディルックがダメージを受けると、攻撃力+10%、攻撃速度+5%、継続時間10秒。最大3重まで、1.5秒毎に1回のみ発動可能。"
        },
        {
          name: "鋼鉄の熾焔",
          desc: "逆焔の刃のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "流火焼灼",
          desc: "リズム的に逆焔の刃を発動することで、ダメージを大幅に上げることができる。逆焔の刃発動2秒後、次の逆焔の刃のダメージ+40%、継続時間2秒。",
        },
        {
          name: "朝を告げる炎の鳥",
          desc: "黎明のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "闇を清算する炎の剣",
          desc: "逆焔の刃発動後、6秒以内の2回の通常攻撃の攻撃速度+30%、攻撃ダメージ+30%。逆焔の刃によって通常攻撃のコンボ数がリセットされることはなくなる。"
        }
      ],
      passives      : [
        {
          name: "ノンストップ",
          desc: "重撃のスタミナ消費-50%、最大継続時間+3秒。"
        },
        {
          name: "溶融の翼",
          desc: "黎明による炎元素付与状態の継続時間+4秒。さらに効果継続中にディルックの与える炎元素ダメージ+20%。"
        }
      ],
      skill         :
        {
          name     : "逆焔の刃",
          desc     : `
前方に向かって大剣を振り、炎元素ダメージを与える。

最大連続で3回使用可能。短時間内に連続で使用しなかった場合、クールタイムに入る。`,
          calcStats: [
            {
              stat: "元素スキル1段ダメージ" // 公式「1段ダメージ」
            },
            {
              stat: "元素スキル2段ダメージ" // 公式「2段ダメージ」
            },
            {
              stat: "元素スキル3段ダメージ" // 公式「3段ダメージ」
            },
            {
              stat: "元素スキルDPS"
            }
          ]
        },
      burst         :
        {
          name     : "黎明",
          desc     : `
列焔の力を爆発させ、周囲の敵をノックバックし、炎元素ダメージを与える。その後、列焔を大剣に集め、前方に飛行する炎の鳥を出し、経路上の敵に大量の炎元素ダメージを与える。炎の鳥は進行経路の終着点で爆発し、大量の炎元素範囲ダメージを与える。
武器に凝集した列焔により、ディルックは炎元素付与状態を獲得する。`,
          calcStats: [
            {
              stat: "斬撃ダメージ" // 公式
            },
            {
              stat: "継続ダメージ" // 公式
            },
            {
              stat: "爆発ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ディオナ
    "Diona": {
      constellations: [
        {
          name: "特製の余韻",
          desc: "特製スピリッツの効果終了時、ディオナの元素エネルギーを15回復する。"
        },
        {
          name: "クールキャッツクロー",
          desc: "フリーズキャッツクローによるダメージ+15%、シールドのダメージ吸収量+15%。命中時、近くに出場している他のキャラクターにフリーズキャッツクロー50%分のダメージを吸収するシールドを付与する、継続時間5秒。",
        },
        {
          name: "お、おかわり？",
          desc: "特製スピリッツのスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "「酒造業キラー」",
          desc: "特製スピリッツのエリアにいる時、ディオナの狙い撃ちのチャージ時間-60%。"
        },
        {
          name: "エクストラアイス",
          desc: "フリーズキャッツクローのスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "キャッツテールが閉店の時",
          desc: `
特製スピリッツのエリアにいるキャラクターは自身の現在HPによって以下の効果を獲得する:
・HPが50%以下の時、受ける治療効果+30%。
・HPが50%より上回る時、元素熟知+200。`
        }
      ],
      passives      : [
        {
          name: "キャッツテールの裏メニュー",
          desc: "フリーズキャッツクローのシールドが存在する時、キャラクターの移動速度+10%、スタミナ消費-10%。"
        },
        {
          name: "滑稽な酔態",
          desc: "特製スピリッツのエリアに入った敵の攻撃力が15秒間-10%。"
        }
      ],
      skill         :
        {
          name     : "フリーズキャッツクロー",
          desc     : `
フリーズキャッツクローを放ち、敵に氷元素ダメージを与え、命中時にシールドを生成する。
シールドのダメージ吸収量はディオナのHP上限によって決まり、継続時間は命中したフリーズキャッツクローの数で決まる。

一回押し
素早くフリーズキャッツクローを2枚発射する。

長押し
素早く後退し、フリーズキャッツクローを5枚発射する。長押しで生成したシールドのダメージ吸収量+75%。

シールドは氷元素ダメージに対して、250%の吸収効果がある。また、シールド生成時、キャラクターに短時間の氷元素付着を与える。`,
          calcStats: [
            {
              stat: "キャッツクローダメージ（1枚）" // 半公式
            },
            {
              stat: "キャッツクローダメージ（5枚）" // 半公式
            },
            {
              stat: "シールド基礎吸収量" // 公式
            },
            {
              stat: "Max Duration"
            }
          ]
        },
      burst         :
        {
          name     : "特製スピリッツ",
          desc     : `
特製の氷入りスピリッツを投げ出し、氷元素範囲ダメージを与え、氷気の酒霧エリアを生成する。

氷気の酒霧エリア
・エリアにいる敵に氷元素ダメージを持続的に与える。
・エリアにいるキャラクターのHPを持続的に回復する。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "エリアの継続ダメージ" // 公式
            },
            {
              stat: "継続回復量" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // フィッシュル
    "Fischl": {
      constellations: [
        {
          name     : "幽邃な鴉の目",
          desc     : "オズが戦場にいない時も、鴉の目を通してフィッシュルを守る。フィッシュルが敵に通常攻撃する時、オズは鴉の目を通して攻撃し、攻撃力22%分のダメージを与える。",
          calcStats: [
            {
              stat: "幽邃な鴉の目ダメージ"
            },
            {
              stat: "幽邃な鴉の目DPS"
            }
          ]
        },
        {
          name: "聖裁の羽根",
          desc: "夜巡りの翼発動時、攻撃力200%分の追加ダメージを与える、さらに影響範囲+50%。"
        },
        {
          name: "黒き翼",
          desc: "夜巡りの翼のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "皇女綺譚集",
          desc     : "夜の幻現発動時、周囲の敵に攻撃力222%分の雷元素ダメージを与える。スキル終了時、フィッシュルのHPを20%回復する。",
          calcStats: [
            {
              stat: "夜の幻現発動時ダメージ"
            }
          ]
        },
        {
          name: "夜の黙示録",
          desc: "夜の幻現のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "永夜の禽",
          desc     : "オズの存在時間+2秒。オズは出場している自身のキャラクターと共に攻撃し、攻撃力30%分の雷元素ダメージを与える。",
          calcStats: [
            {
              stat: "永夜の禽ダメージ"
            },
            {
              stat: "永夜の禽DPS"
            }
          ]
        }
      ],
      passives      : [
        {
          name     : "星喰いの鴉",
          desc     : "フィッシュルのチャージした狙い撃ち射撃がオズに命中すると、オズは周囲の敵に聖裁の雷を放ち、射撃ダメージ152.7%分の雷元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "星喰いの鴉ダメージ"
            }
          ]
        },
        {
          name     : "断罪の雷影",
          desc     : "オズがフィールドにいる時、出場している自身のキャラクターの敵への攻撃が雷元素の関連反応を起こすと、敵に聖裁の雷を下し、フィッシュルの攻撃力80%分の雷元素ダメージを与える。",
          calcStats: [
            {
              stat: "断罪の雷影ダメージ"
            }
          ]
        }
      ],
      skill         :
        {
          name     : "夜巡りの翼",
          desc     : `
オズを召喚する。暗影と雷電によって構成された鴉が降臨する時、狭範囲の雷元素ダメージを与える。
オズが存在する時、雷の魔弾を発射し、付近の敵を自動で攻撃する。

長押しでスキルの発動位置を調整可能。
オズが存在する間に再び一回押すとオズを自身の傍に呼び寄せる。`,
          calcStats: [
            {
              stat: "オズの攻撃ダメージ" // 公式
            },
            {
              stat: "召喚ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "夜の幻現",
          desc     : `
オズを召喚し、純粋なる夜色の翼を広げてフィッシュルを守る。
継続期間中、下記の効果が発動する:
・フィッシュルはオズ形態で高速移動する。
・付近の敵に落雷で攻撃し、雷元素ダメージを与える。落雷によるダメージは同じ敵に1回のみ有効。
・効果終了時、オズは戦場に留まり、皇女の敵を攻撃する。発動前にオズがすでに戦場に存在してる場合は、オズの継続時間がリセットされる。`,
          calcStats: [
            {
              stat: "落雷ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ジン
    "Jean": {
      constellations: [
        {
          name: "剣脊に流れる暴風",
          desc: "風圧剣の長押しが1秒以上の時、吸い寄せる速度がアップし、与えるダメージ+40%。",
        },
        {
          name: "人々を守る盾",
          desc: "ジンが元素オーブまたは元素粒子を獲得した時、チームにいる全てのキャラクターの移動速度+15%、攻撃速度+15%、継続時間15秒。"
        },
        {
          name: "西風が吹く時",
          desc: "蒲公英の風のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "蒲公英の国土",
          desc: "蒲公英の風エリア内、全ての敵の風元素耐性-40%。"
        },
        {
          name: "しばしの烈風",
          desc: "風圧剣のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "民を眷顧する獅子の牙",
          desc: "蒲公英の風エリア内、キャラクターの受けるダメージ-35%。エリアを出た後、この効果は3回攻撃を受けた後、または10秒後になくなる。"
        }
      ],
      passives      : [
        {
          name     : "風の赴くままに",
          desc     : "ジンの通常攻撃が命中する時、50%の確率でチーム全員のHPを回復する。回復量はジンの攻撃力の15%に相当する。",
          calcStats: [
            {
              stat: "命中回復量"
            }
          ]
        },
        {
          name: "風の導くままに",
          desc: "蒲公英の風発動後、元素エネルギーが20%回復する。"
        }
      ],
      skill         :
        {
          name     : "風圧剣",
          desc     : `
形のない風を剣に集中させ、小型の嵐を放つ。敵を狙った方向にノックバックし、大量の風元素ダメージを与える。

長押し
スタミナを消費する代わりに、周囲の敵と物体を目の前に吸い寄せることができる。
方向の調整が可能。
長押し中は移動できない。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "蒲公英の風",
          desc     : `
風の加護を呼び、千風が流れる蒲公英エリアを作り出し、周囲の敵に風ダメージを与え、ノックバックする。
ジンの攻撃力を基準にチームメンバーのHPを大量に回復する。

蒲公英エリア
・エリア内にいるキャラクターのHPを継続回復する。
・エリア内にいるキャラクターは継続的に風元素の影響を受ける。
・エリアを出入りする敵に風ダメージを与える。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「爆発ダメージ」
            },
            {
              stat: "エリア出入りダメージ" // 公式
            },
            {
              stat: "エリア内の回復量" // 公式
            },
            {
              stat: "継続回復" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ガイア
    "Kaeya": {
      constellations: [
        {
          name: "優れた血筋",
          desc: "氷元素の影響を受けた敵に対して、ガイアの通常攻撃と重撃の会心率+15%。"
        },
        {
          name: "無尽なる霜舞",
          desc: "凛冽なる輪舞継続中に敵を撃破したとき、継続時間+2.5秒、最大15秒まで。"
        },
        {
          name: "凛冽なる戯れ",
          desc: "霜の襲撃のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "極寒の口付け",
          desc     : `
ガイアのHPが20%の時に自動で発動する:
HP上限30%分のシールドを吸収するシールド生成する。継続時間20秒。
シールドは氷元素ダメージに対して250%の吸収効果がある。
60秒毎に1回のみ発動可能。`,
          calcStats: [
            {
              stat: "シールド吸収量"
            }
          ]
        },
        {
          name: "冷たい抱擁",
          desc: "凛冽なる輪舞のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "輪旋の氷",
          desc: "凛冽なる輪舞の氷柱が1本追加され、発動時に元素エネルギーが15回復する。"
        }
      ],
      passives      : [
        {
          name     : "冷血の剣",
          desc     : "霜の襲撃が敵1体に命中する度、攻撃力15%分のHPを回復する。",
          calcStats: [
            {
              stat: "命中回復量"
            }
          ]
        },
        {
          name: "氷淵の心",
          desc: "霜の襲撃が敵を凍結状態にした場合、凍結された敵から追加の元素粒子が落ちる。1回の霜襲は2つの元素粒子が追加で発生する。"
        }
      ],
      skill         :
        {
          name     : "霜の衝撃",
          desc     : "急速に凍結する寒気を放ち、前方の敵に氷元素ダメージを与える。",
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "凛冽なる輪舞",
          desc     : "空気中の霜を凝集させ、自身を囲む氷柱を3本召喚する。スキル継続中、氷柱はキャラクターと共に動き、経路上の敵に氷元素ダメージを与える。",
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 刻晴
    "Keqing": {
      constellations: [
        {
          name     : "迅雷",
          desc     : "雷楔継続中に再び星辰帰位を発動すると、刻晴は消失位置と出現位置に攻撃力50%分の雷元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "迅雷ダメージ"
            }
          ]
        },
        {
          name: "苛捐",
          desc: "刻晴の通常攻撃と重撃が雷元素の影響を受けた敵に命中した時、50%の確率で元素粒子を1個生成する。5秒毎に1回のみ発動可能。"
        },
        {
          name: "登楼",
          desc: "天街巡遊のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "調律",
          desc: "刻晴が雷元素の関連反応を起こした10秒間、攻撃力+25%。"
        },
        {
          name: "移燈",
          desc: "星辰帰位のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "廉貞",
          desc: "通常攻撃、重撃、元素スキルまたは元素爆発を発動する時、刻晴の与える雷元素ダメージ+6%、継続時間8秒。通常攻撃、重撃、元素スキルまたは元素爆発の発動による効果はそれぞれ別々でカウントされる。"
        }
      ],
      passives      : [
        {
          name: "抵天の雷罰",
          desc: "雷楔継続中に再び星辰帰位を発動すると、刻晴は雷元素付与状態を獲得する。継続時間5秒。"
        },
        {
          name: "玉衡の貴",
          desc: "天街巡遊継続中、刻晴の会心率+15%、元素チャージ効率+15%、継続時間8秒。"
        }
      ],
      skill         :
        {
          name     : "星辰帰位",
          desc     : `
雷楔を素早く投げ出し、疾雷の勢いで敵を殲滅する。
雷楔が命中した時に狭範囲の敵に雷元素ダメージを与え、命中した位置に雷楔マークを残す。

長押し
長押しで雷楔マークの投げる方向を調整できる。
長押しで投げ出した雷楔は空中に浮遊させることができる。刻晴が再び星辰帰位を発動する時、地形を無視できる。

雷楔
雷楔継続中、刻晴が再び星辰帰位または重撃を発動すると、雷楔マークは消され、異なる効果を発動できる:
・再び星辰帰位を発動すると、マークした位置に瞬間移動し斬撃を1回仕掛け、雷元素範囲ダメージを与える。長押しで投げ出した雷楔の位置に瞬間移動する場合は地形を無視する。
・重撃を行った場合、マークした位置に暴雷連斬を引き起こし、数回の雷元素範囲ダメージを与える。`,
          calcStats: [
            {
              stat: "雷楔ダメージ" // 公式
            },
            {
              stat: "斬撃ダメージ" // 公式
            },
            {
              stat: "雷連斬ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "天街巡遊",
          desc     : `
雷電の力を爆発させ、雷元素範囲ダメージを与える。
その後、剣影に隠れ、敵に迅雷の如き高速連斬を発動し、連続で雷元素ダメージを与える。最後の一撃は大量の雷元素範囲ダメージを与える。`,
          calcStats: [
            {
              stat: "発動時ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "連斬ダメージ" // 公式
            },
            {
              stat: "最後の一撃ダメージ" // 公式
            },
            {
              stat: "元素爆発合計ダメージ"
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // クレー
    "Klee": {
      constellations: [
        {
          name     : "ゴロゴロコンボ",
          desc     : "攻撃やスキル発動時、一定の確率で花火を召喚して敵を攻撃し、ドッカン花火の攻撃力120%分のダメージを与える。",
          calcStats: [
            {
              stat: "ゴロゴロコンボダメージ"
            }
          ]
        },
        {
          name: "弾丸の破片",
          desc: "ボンボン爆弾のブービートラップのダメージを受けた敵の防御力-23%、継続時間10秒"
        },
        {
          name: "クレー特製",
          desc: "ボンボン爆弾のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "一触即発",
          desc     : "ドッカン花火継続中にキャラクターを切り替えると、爆発が発生し、攻撃力555%分の炎元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "一触即発ダメージ"
            }
          ]
        },
        {
          name: "轟撃の星",
          desc: "ドッカン花火のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "火力全開",
          desc: "ドッカン花火状態中、クレーは3秒毎にチーム全員（クレーを除く）の元素エネルギーを3回復する。ドッカン花火発動後25秒間、チーム全員の炎元素ダメージ+10%。"
        }
      ],
      passives      : [
        {
          name: "こんこんプレゼント",
          desc: "ボンボン爆弾と通常攻撃が敵にダメージを与えた時、50%の確率でクレーは爆裂花火を獲得する。重撃を発動する時、スタミナの変わりに爆裂花火を優先的に消費し、与えるダメージ+50%。"
        },
        {
          name: "無限花火",
          desc: "クレーの重撃が会心を発生すると、チーム全員の元素エネルギーが2回復する。"
        }
      ],
      skill         :
        {
          name     : "ボンボン爆弾",
          desc     : `
巨大な威力を持つボンボン爆弾を投げ出す!
ボンボン爆弾は連続で3回跳ね、1回毎に爆発を起こし、炎元素範囲ダメージを与える。

3回跳ねた後、爆弾は複数のブービートラップに分裂する。
ブービートラップは敵に触れるか、または一定時間後に爆発し、炎元素範囲ダメージを与える。

初期使用可能回数2回。`,
          calcStats: [
            {
              stat: "ボンボン爆弾ダメージ" // 公式
            },
            {
              stat: "ブービートラップダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "ドッカン花火",
          desc     : "クレー火力全開! スキル継続中、ドッカン花火を立て続けに召喚して周囲の敵を攻撃し、炎元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "ドッカン花火ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // リサ
    "Lisa": {
      constellations: [
        {
          name: "無限の電気回路",
          desc: "蒼雷を長押しで発動した後、敵に命中する度にリサの元素エネルギーが2回復する。一回で最大10まで回復可能。"
        },
        {
          name: "空間電位の結界",
          desc: `
蒼雷長押し時に下記の効果が付与される:
・防御力+25%。
・リサの中断耐性をアップする。`
        },
        {
          name: "共振の雷光",
          desc: "薔薇の雷光のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "雨の如くプラズマ",
          desc: "薔薇の雷光が攻撃する時、放つ稲妻が1～3本に増加する。"
        },
        {
          name: "プラズマ落雷",
          desc: "蒼雷のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "パルスの魔女",
          desc: "登場時、周囲の敵に蒼雷の誘雷効果を3重付与する。この効果は5秒毎に1回のみ発動可能。"
        }
      ],
      passives      : [
        {
          name: "感電余震",
          desc: "重撃が命中した時、敵に蒼雷の誘雷効果を付与する。"
        },
        {
          name: "静電気フィールド",
          desc: "薔薇の雷光攻撃を受けた敵の防御力-15%、継続時間10秒。"
        }
      ],
      skill         :
        {
          name     : "蒼雷",
          desc     : `
雷の力で、面倒なものを全て綺麗に片付ける。

一回押し
自動的に索敵する球状の稲妻を放つ。
命中後、標的に雷元素ダメージを与え、狭範囲の敵に最大3重までの誘雷効果を付与する。

長押し
短い詠唱をした後、雷を落下させ、周囲にいる全ての敵に雷元素ダメージを与える。
敵が誘雷状態の場合、誘雷効果を解除し、重ねた回数をもとに追加ダメージを与える。`,
          calcStats: [
            {
              stat: "一回押しダメージ" // 公式
            },
            {
              stat: "誘雷なしの長押しダメージ" // 公式
            },
            {
              stat: "誘雷1重の長押しダメージ" // 公式
            },
            {
              stat: "誘雷2重の長押しダメージ" // 公式
            },
            {
              stat: "誘雷3重の長押しダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "薔薇の雷光",
          desc     : `
薔薇の雷光を召喚し、強い雷の力を放ち、周囲の敵に雷ダメージを与え、ノックバックする。
継続時間中、薔薇の雷光は周囲の敵を攻撃し、雷ダメージを与える。`,
          calcStats: [
            {
              stat: "放電ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // モナ
    "Mona": {
      constellations: [
        {
          name: "沈没の預言",
          desc: `
チーム内の自身のキャラクターの攻撃が星異状態の敵に命中した後の8秒間、水元素の関連反応の効果が上昇する:
・感電反応ダメージ+15%、蒸発反応ダメージ+15%、水元素の拡散反応によるダメージ+15%。
・凍結反応の継続時間+15%。`
        },
        {
          name: "星月の連珠",
          desc: "通常攻撃が命中した時、20%の確率で自動的に重撃を発動する。5秒毎に一回のみ発動可能。"
        },
        {
          name: "果てしない天象",
          desc: "星命定軌のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "絶滅の預言",
          desc: "チーム内の自身のキャラクターが星異状態の敵を攻撃する時、会心率+15%。"
        },
        {
          name: "運命の愚弄",
          desc: "水中幻願のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "災厄の修辞",
          desc: "モナが虚実流動状態に入った後、1秒移動する毎に、次の重撃ダメージ+60%。最大180%まで、継続時間8秒。"
        }
      ],
      passives      : [
        {
          name     : "「おばば、私を捕まえられますか～」",
          desc     : "虚実流動状態に入った2秒後、周囲に敵がいる場合、自動的に虚影を1つ生成する。虚影は2秒間存在した後に破裂する。破裂ダメージは水中幻願のダメージの50%に相当する。",
          calcStats: [
            {
              stat: "虚影破裂ダメージ"
            }
          ]
        },
        {
          name     : "「運命の流れに任せましょう！」",
          desc     : "モナの与える水元素ダメージが増加する。増加量はモナの元素チャージ効率の20%に相当する。",
          calcStats: [
            {
              stat: "増加水元素ダメージ（%）"
            }
          ]
        }
      ],
      skill         :
        {
          name     : "水中幻願",
          desc     : `
水しぶきを集め、運命の虚影を形成する。

虚影
以下の特性を持つ:
・持続的に敵を挑発し、攻撃を引き寄せる。
・持続的に付近の敵に水元素範囲ダメージを与える。
・継続時間終了時、虚影が破裂し、水元素範囲ダメージを与える。

長押し
水流の勢いを利用し、素早く後退する。

水中幻願によって作られた虚影は、同時に最大1つまで存在可能。`,
          calcStats: [
            {
              stat: "継続ダメージ" // 公式
            },
            {
              stat: "爆裂ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "星命定軌",
          desc     : `
清らかなさざなみを集め、虚幻の星空を映し、広範囲の敵に泡影状態を与える。

泡影
星の泡で敵を拘束し、湿潤状態を付与する。
比較的に弱い敵は泡影に拘束され、行動不能になる。
泡影状態の敵がダメージを受けると、以下の効果を受ける:
・星異状態を与えられ、次に受けるダメージが上昇する。
・泡影の効果が解除する。解除時、水元素ダメージを受ける。

星異
星異状態継続中、受けるダメージがアップする。`,
          calcStats: [
            {
              stat: "泡影破裂ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 凝光
    "Ningguang": {
      constellations: [
        {
          name: "散る星の破片",
          desc: "通常攻撃が命中すると範囲ダメージを与える。"
        },
        {
          name: "璇璣、崑崙を鎮める",
          desc: "璇璣屏が破裂した時、クールタイムがリセットする。6秒毎に1回のみ発動可能。"
        },
        {
          name: "森羅星列の囲い",
          desc: "王権崩玉のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "神機妙道の陣組み",
          desc: "璇璣屏付近のキャラクターの全元素耐性+10%。"
        },
        {
          name: "瓊屏と千扇の守り",
          desc: "璇璣屏のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "燦々たる七星",
          desc: "天権崩玉を放つ時、凝光に七枚の星璇を生成する。"
        }
      ],
      passives      : [
        {
          name: "物換星移",
          desc: "星璇がついている間、凝光の重撃はスタミナを消費しない。"
        },
        {
          name: "備えあれば憂いなし",
          desc: "璇璣屏を突き抜けたキャラクターの岩元素ダメージ+12%、継続時間10秒。"
        }
      ],
      skill         :
        {
          name     : "璇璣屏",
          desc     : `
黄金、黒曜岩、強者の余裕で璇璣屏を作り、岩元素範囲ダメージを与える。

璇璣屏
・敵の投擲攻撃を防御する。
・耐久度は凝光のHPによって決まる。

璇璣屏は岩元素創造物と見なされ、一部の攻撃を防ぐことができるが、璇璣屏に登ることはできない。同時に最大1つまで存在可能。`,
          calcStats: [
            {
              stat: "HP継承" // 公式
            },
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "天権崩玉",
          desc     : `
自身の周りに宝石を凝聚させ、それらを一気に放つ。自動索敵する宝石は周りの敵を攻撃し、大量の岩元素ダメージを与える。
周りに璇璣屏が存在する時に天権崩玉を発動すると、璇璣屏から追加で宝石が放たれ、敵を攻撃する。`,
          calcStats: [
            {
              stat: "宝石ダメージ（1個）" // 半公式
            },
            {
              stat: "宝石ダメージ（3個）" // 半公式
            },
            {
              stat: "宝石ダメージ（6個）" // 半公式
            },
            {
              stat: "宝石ダメージ（12個）" // 半公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ノエル
    "Noelle": {
      constellations: [
        {
          name: "支援はお任せください",
          desc: "同時に大掃除と護心鎧状態にいる時、護心鎧のHP回復効果の発動率が100%になる。"
        },
        {
          name: "旋風のメイド",
          desc: "ノエルの重撃によるスタミナ消費-20%、与えるダメージ+15%。"
        },
        {
          name: "怪我はしません",
          desc: "護心鎧のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "綺麗にしますから",
          desc     : "護心鎧効果終了時、またはダメージによって破壊された時、周囲の敵に攻撃力400%分の元素岩ダメージを与える。",
          calcStats: [
            {
              stat: "護心鎧効果終了時ダメージ"
            }
          ]
        },
        {
          name: "騎士団の掃除達人",
          desc: "大掃除のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "埃は許しません",
          desc     : "大掃除発動で、ノエルの防御力50%分の攻撃力を追加でアップする。スキル継続中、敵1体倒す度に継続時間+1秒。最大10秒まで。",
          calcStats: [
            {
              stat: "追加の攻撃力上昇"
            }
          ]
        }
      ],
      passives      : [
        {
          name     : "誠心誠意",
          desc     : `
ノエルが待機時、出場している自身のキャラクターのHPが30%以下になると自動で発動される:
出場している自身のキャラクターにノエルの防御力400%分のダメージを吸収するシールドを付与する、継続時間20秒。
・全ての元素ダメージと物理ダメージに対して150%の吸収効果がある。
60秒毎に1回のみ発動可能。`,
          calcStats: [
            {
              stat: "シールド吸収量"
            }
          ]
        },
        {
          name: "きれいさっぱり",
          desc: "通常攻撃または重撃が4回命中する度に、護心鎧のクールタイム-1秒。攻撃が同時に複数の敵に命中した場合は1回としてカウントされる。"
        }
      ],
      skill         :
        {
          name     : "護心鎧",
          desc     : `
護身の岩鎧を召喚し、周囲の敵に岩元素ダメージを与え、シールドを生成する。ダメージ吸収量はノエルの防御力によって決まる。
シールドは下記の効果が発動する:
・ノエルの通常攻撃または重撃が命中した時、一定の確率でチーム全員のHPを回復する。
・全元素ダメージと物理ダメージに150%の吸収効果がある。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "吸収量" // 公式
            },
            {
              stat: "回復量" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "大掃除",
          desc     : `
盤石の力を武器に凝集させ、周囲の敵に衝撃を与えて広範囲攻撃を1回行い、岩元素ダメージを与える。
その後、下記の効果が発動される:
・ノエルの攻撃範囲が大幅にアップする。
・攻撃ダメージは岩元素ダメージとなり、元素付与によって他の元素に変化することはない。
・ノエルの防御力を基準に攻撃力がアップする。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「爆発ダメージ」
            },
            {
              stat: "攻撃ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "攻撃力上昇" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 七七
    "Qiqi": {
      constellations: [
        {
          name: "寒苦回向",
          desc: "度厄のお礼マークがついている敵に寒病鬼差が命中した時、七七の元素エネルギーを2回復する。"
        },
        {
          name: "氷寒蝕骨",
          desc: "氷元素の影響を受けた敵に、七七の通常攻撃と重撃の与えるダメージ+15%。"
        },
        {
          name: "昇天宝誥",
          desc: "仙法・救苦度厄のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "天威圧衆",
          desc: "度厄のお札マークがついている敵の攻撃力-20%。"
        },
        {
          name: "紅蓮開花",
          desc: "仙法・寒病鬼差のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "起死回骸",
          desc: "仙法・救苦度厄を発動する時、近くにいるチーム内全ての戦闘不能状態のキャラクターを復活し、HPを50%まで回復させる。この効果は15分毎に1回のみ発動可能。"
        }
      ],
      passives      : [
        {
          name: "延命妙法",
          desc: "仙法・寒病鬼差状態時のキャラクターが元素反応を起こした時、受ける治療効果+20%、継続時間8秒。"
        },
        {
          name: "玉籤偶開",
          desc: "七七の通常攻撃と重撃が敵に命中した時、50%の確率で敵に度厄のお札を1枚付与する、継続時間6秒、30秒毎に1回のみ発動可能。"
        }
      ],
      skill         :
        {
          name     : "仙法・寒病鬼差",
          desc     : `
氷血がお札となり、寒病鬼差を召喚し、周囲の敵に氷元素ダメージを与える。

寒病鬼差
・七七の通常攻撃と重撃が命中した時、チーム内の自身のキャラクター全員または付近の味方のHPを回復する。回復量は七七の攻撃力によって決まる。
・一定時間の間隔で、出場している自身のキャラクターのHPを回復する。
・キャラクターと共に行動し、経路上の敵に氷元素ダメージを与える。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "命中による回復量" // 公式
            },
            {
              stat: "継続回復量" // 公式
            },
            {
              stat: "寒病獄卒ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "仙法・救苦度厄",
          desc     : `
体内に封印された仙力を解放し、度厄のお札で付近の敵にマークをつけ、氷元素ダメージを与える。

度厄のお札
度厄のお札に影響された敵にダメージを与えた時、そのキャラクター自身のHPを回復する。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "回復量" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // レザー
    "Razor": {
      constellations: [
        {
          name: "狼の性",
          desc: "レザーが元素オーブまたは元素粒子を獲得した8秒間、与えるダメージが+10%。"
        },
        {
          name: "制圧",
          desc: "HPが30%以下の敵を攻撃する時、会心率+10%。"
        },
        {
          name: "獣の魂",
          desc: "雷牙のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "噛みつく",
          desc: "鋭い爪と蒼雷の一回押しで攻撃した時、命中した敵の防御力-15%、継続時間7秒。"
        },
        {
          name: "鋭い爪",
          desc: "鋭い爪と蒼雷のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "天狼",
          desc     : "10秒毎に、レザーの大剣が自動的にエネルギーを溜め、次の通常攻撃に落雷を引き起こし、攻撃力100%分の雷元素ダメージを与える。雷牙状態でない時、落雷が敵に命中すると、レザーに鋭い爪と蒼雷の雷の印を1重付与する。",
          calcStats: [
            {
              stat: "天狼ダメージ"
            },
            {
              stat: "天狼DPS"
            }
          ]
        }
      ],
      passives      : [
        {
          name: "覚醒",
          desc: "鋭い爪と蒼雷のクールタイム-18%。雷牙を放つ時、鋭い爪と蒼雷のクールタイムをリセットする。"
        },
        {
          name: "飢餓",
          desc: "レザーの元素エネルギーが50%以下になると、元素チャージ効率+30%。"
        }
      ],
      skill         :
        {
          name     : "鋭い爪と蒼雷",
          desc     : `
一回押し
雷狼の爪を振り、前方の敵に雷元素ダメージを与える。
敵に命中すると、雷の印を1つ蓄積し、レザーの元素チャージ効率がアップする。
雷の印は同時に最大3つまで存在でき、新しい雷の印を獲得すると全ての雷の印の継続時間がリセットされる。

長押し
雷の力を集めて狭範囲の雷爆発を起こし、大量の雷元素ダメージを与える。同時に、レザーの雷の印を全て取り除く。
取り除かれた雷の印は全てレザーの元素エネルギーに変換される。`,
          calcStats: [
            {
              stat: "一回押しスキルダメージ" // 公式
            },
            {
              stat: "長押しスキルダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "雷牙",
          desc     : `
無形の雷狼を召喚して自身を守り、周囲の敵に雷元素ダメージを与える。同時に、雷の印を消耗して自身の元素エネルギーを回復する。
雷狼が存在している間、レザーと共に戦う。

雷狼
・レザーの通常攻撃に協力し、雷元素ダメージを与える。
・レザーの攻撃速度と雷元素耐性をアップする。
・感電反応によるダメージを無効化する。
・重撃の発動が不可になる。
・レザーの中断耐性がアップする。

レザーが退場する時、効果が解除される。
退場時、残り時間を基準に、元素エネルギーを最大10まで回復する。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「爆発ダメージ」
            },
            {
              stat: "狼の魂DPS"
            },
            {
              stat: "狼の魂 1段ダメージ"
            },
            {
              stat: "狼の魂 2段ダメージ"
            },
            {
              stat: "狼の魂 3段ダメージ"
            },
            {
              stat: "狼の魂 4段ダメージ"
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // スクロース
    "Sucrose": {
      constellations: [
        {
          name: "積み上げ真空域",
          desc: "風霊作成・六三〇八の発動可能回数+1。"
        },
        {
          name: "不羈型ベト",
          desc: "禁・風霊作成・七五同構弐型のスキル継続時間+2秒。"
        },
        {
          name: "ゼロミス少女",
          desc: "風霊作成・六三〇八のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "錬金の偏執",
          desc: "スクロースが通常攻撃または重撃を7回発動すると、風霊作成・六三〇八のクールタイムがランダムに1～7秒減少する。"
        },
        {
          name: "真面目な普通瓶",
          desc: "禁・風霊作成・七五同構弐型のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "混合熵増論",
          desc: "禁・風霊作成・七五同構弐型に元素変化が起きた時、スキル継続中チーム全員の該当元素ダメージ+20%。"
        }
      ],
      passives      : [
        {
          name: "触媒置換術",
          desc: "スクロースが拡散反応を起こした時、該当元素のチームメンバー全員（スクロース自身を除く）の元素熟知+50、継続時間8秒。"
        },
        {
          name: "小さな恵風",
          desc: "風霊作成・六三〇八又は禁・風霊作成・七五同構弐型が敵に命中した時、スクロースの元素熟知の20%を基準に、チーム全員（スクロース自身を除く）の元素熟知を強化する、継続時間8秒。"
        }
      ],
      skill         :
        {
          name     : "風霊作成・六三〇八",
          desc     : "小型風霊を召喚し、敵と物体を風霊の位置に吸い寄せ、範囲内の敵をノックバックし、風元素ダメージを与える。",
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "禁・風霊作成・七五同構弐型",
          desc     : `
不安定なフラスコを投げ出し、大型風霊を生成する。
風霊が存在している間、持続的に付近の敵と物体を吸い寄せてノックバックし、風元素ダメージを持続的に与える。

元素変化
風霊がスキル継続中に水元素/炎元素/氷元素/雷元素に接触すると、接触した元素の属性を獲得し、該当元素の付加ダメージを追加で与える。
元素変化はスキル継続中に1回のみ発生する。`,
          calcStats: [
            {
              stat: "継続ダメージ" // 公式
            },
            {
              stat: "付加元素ダメージ（炎）" // 半公式
            },
            {
              stat: "付加元素ダメージ（氷）" // 半公式
            },
            {
              stat: "付加元素ダメージ（水）" // 半公式
            },
            {
              stat: "付加元素ダメージ（雷）" // 半公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // タルタリヤ
    "Tartaglia": {
      constellations: [
        {
          name: "魔王の武装・押波",
          desc: "魔王の武装・荒波のクールタイムが-20%。"
        },
        {
          name: "魔王の武装・暗流",
          desc: "断流効果の影響を受けた敵が倒されると、タルタリヤの元素エネルギーが4回復する。"
        },
        {
          name: "淵の災い・紛争の源",
          desc: "魔王の武装・荒波のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name     : "淵の災い・復水放流",
          desc     : `
4秒毎に、タルタリヤによって発動された断流効果がフィールドに存在する時、タルタリヤが魔王の武装・荒波の近接モードの場合、断流・斬を発動する。それ以外の場合、断流・閃を発動する。
この効果によって発動された断流・斬と断流・閃は、この二つのスキル本来の発動時間制限を受けない。また、本来のスキルへの発動時間制限にも影響を与えない。`,
          calcStats: [
            {
              stat: "復水放流 断流・斬DPS"
            },
            {
              stat: "復水放流 断流・閃DPS"
            }
          ]
        },
        {
          name: "極悪技・雨斬り",
          desc: "極悪技・尽滅閃のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "極悪技・天使の滅び",
          desc: "極悪技・尽滅閃発動時、魔王の武装・荒波のクールタイムをリセットする。この効果は遠隔モードに戻った後に発動する。"
        }
      ],
      passives      : [
        {
          name: "無尽蔵",
          desc: "断流効果の継続時間+8秒。"
        },
        {
          name: "水形剣",
          desc: "魔王の武装・荒波の近接モード時、通常攻撃と重撃が会心を発生すると、命中した敵に断流効果を付与する。"
        }
      ],
      skill         :
        {
          name     : "魔王の武装・荒波",
          desc     : `
水で構成された武装を解放し、周囲の敵に水元素ダメージを与え、近接モードに入る。
この状態の時、タルタリヤの通常攻撃と重撃は水元素ダメージとなり、元素付与によって他の元素に変化することはない。また、攻撃は下記のように変化する:

通常攻撃
最大6段の水元素斬撃を行う。

重撃
スタミナを消費して前方に斬撃を2回放ち、水元素ダメージを与える。

断流・斬
近接攻撃が断流状態の敵に命中すると断流・斬を1回発動し、水元素範囲ダメージを与える。断流・斬が与えたダメージは元素スキルダメージと見なされ、1.5秒毎に1回のみ発動可能。

スキル発動30秒後、または再びスキルを発動すると効果が解除され、遠隔モードに戻り、クールタイムに入る。近接モードの継続時間が長いほど、クールタイムは長くなる。
30秒継続した後に自動的に遠隔モードに戻った場合、スキルのクールタイムは更に長くなる。`,
          calcStats: [
            {
              stat: "斬撃DPS"
            },
            {
              stat: "断流・斬 ダメージ" // 公式
            },
            {
              stat: "斬撃+断流・斬DPS"
            },
            {
              stat: "断流・斬DPS"
            },
            {
              stat: "状態切替時に与えるダメージ" // 公式
            },
            {
              stat: "斬撃 1段ダメージ" // 公式「1段ダメージ」
            },
            {
              stat: "斬撃 2段ダメージ" // 公式「2段ダメージ」
            },
            {
              stat: "斬撃 3段ダメージ" // 公式「3段ダメージ」
            },
            {
              stat: "斬撃 4段ダメージ" // 公式「4段ダメージ」
            },
            {
              stat: "斬撃 5段ダメージ" // 公式「5段ダメージ」
            },
            {
              stat: "斬撃 6段ダメージ" // 公式「6段ダメージ」
            },
            {
              stat: "斬撃 重撃ダメージ" // 公式「重撃ダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "極悪技・尽滅閃",
          desc     : `
タルタリヤの戦闘モードによって、異なる攻撃を発動する:

遠隔モード・魔弾一閃
前方に素早く水元素を込めた魔矢を放ち、水元素範囲ダメージを与え、敵に断流効果を付与する。
発動後、元素エネルギーが一部返還される。

近接モード・尽滅の水光
広範囲の斬撃を1回仕掛け、周囲全ての敵に大量の水元素ダメージを与え、断流・爆を発動する。

断流・爆
尽滅の水光が断流状態の敵に命中した場合、断流効果が消耗され、スチームバーストを発生させて水元素範囲ダメージを与える。断流・爆が与えたダメージは元素爆発ダメージと見なされる。`,
          calcStats: [
            {
              stat: "近接+断流・爆 ダメージ"
            },
            {
              stat: "元素爆発ダメージ・近接" // 公式「スキルダメージ・近接」
            },
            {
              stat: "元素爆発ダメージ・遠隔" // 公式「スキルダメージ・遠隔」
            },
            {
              stat: "断流・爆 ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 旅人（風）
    "Traveler (Anemo)": {
      constellations: [
        {
          name: "回転する怒風",
          desc: "旋風の剣は周囲5メートル以内の敵と物体をゆっくりと自分の前に吸い寄せることができる。"
        },
        {
          name: "革新の旋風",
          desc: "元素チャージ効率+16%。"
        },
        {
          name: "天地の剛風",
          desc: "激風の息のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "恩眷の和風",
          desc: "旋風の剣継続中､自身の受けるダメージ-10%。"
        },
        {
          name: "群星の渦風",
          desc: "旋風の剣のスキルLv.3。最大Lv.15まで。"
        },
        {
          name: "もつれる信風",
          desc: "激風の息によるダメージを受けた目標の風元素耐性-20%。元素変化があった場合､該当の元素耐性-20%。"
        }
      ],
      passives      : [
        {
          name     : "空を裂く風",
          desc     : "通常攻撃の最後の1撃が風の刃を放つようになり、経路上の敵に攻撃力60%分の風元素ダメージを与える。",
          calcStats: [
            {
              stat: "風の刃ダメージ"
            }
          ]
        },
        {
          name: "蘇生の風",
          desc: "旋風の剣で敵を倒した後、1秒毎にHPを2%回復する、継続時間5秒。5秒に1回のみ発動可能。"
        }
      ],
      skill         :
        {
          name     : "旋風の剣",
          desc     : `
風の力を握りしめ、手のひらに真空の渦を集中させ、前方の敵に風元素ダメージを持続的に与える。
スキル終了時、真空の渦は爆発し、より広範囲で強力な風元素ダメージを与える。

長押し
ダメージと影響範囲が徐々に大きくなる。

元素変化
真空の渦がスキル継続中に水元素/炎元素/氷元素/雷元素に接触すると、接触した元素の属性を獲得し、該当元素の付加ダメージを追加で与える。
元素変化はスキル継続中に1回のみ発生する。`,
          calcStats: [
            {
              stat: "初期切裂ダメージ" // 公式
            },
            {
              stat: "最大切裂ダメージ" // 公式
            },
            {
              stat: "初期爆風ダメージ" // 公式
            },
            {
              stat: "最大爆風ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "激風の息",
          desc     : `
風を導き、前方に継続前進する竜巻を召喚する。経路上の物体と敵を巻き込み、風元素ダメージを持続的に与える。

元素変化
竜巻がスキル継続中に水元素/炎元素/氷元素/雷元素に接触すると、接触した元素の属性を獲得し、該当元素の付加ダメージを追加で与える。
元素変換はスキル継続中に1回のみ発生する。`,
          calcStats: [
            {
              stat: "竜巻ダメージ" // 公式
            },
            {
              stat: "付加元素ダメージ（炎）" // 半公式
            },
            {
              stat: "付加元素ダメージ（氷）" // 半公式
            },
            {
              stat: "付加元素ダメージ（水）" // 半公式
            },
            {
              stat: "付加元素ダメージ（雷）" // 半公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 旅人（岩）
    "Traveler (Geo)": {
      constellations: [
        {
          name: "巍然たる青岩",
          desc: "チーム内キャラクターが岩潮幾重の岩の山に包囲されている時、会心率+10%、中断耐性がアップする。"
        },
        {
          name     : "不穏な溶岩",
          desc     : "星落としの剣の荒星が破壊される時に爆破が再び発生し、周囲の敵に星落としの剣のダメージに相当する岩元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "不穏な溶岩ダメージ"
            }
          ]
        },
        {
          name: "八方の岩",
          desc: "岩潮幾重のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "険しい重岩",
          desc: "岩潮幾重が引き起こす振動波が敵に命中する度に、元素エネルギーが5回復する。この方法で一回で最大25まで回復可能。"
        },
        {
          name: "天墜の岩",
          desc: "星落としの剣のスキルLv.3。最大Lv.15まで。"
        },
        {
          name: "永世の磐岩",
          desc: "岩潮幾重の岩の山の継続時間+5秒。星落としの剣荒星の継続時間+10秒。"
        }
      ],
      passives      : [
        {
          name: "破れた断崖",
          desc: "星落としの剣のクールタイム-2秒。"
        },
        {
          name     : "狂乱の岩崩れ",
          desc     : "通常攻撃の最後1撃が岩崩れを起こすようになり、範囲内の敵に攻撃力60%分の岩元素ダメージを与える。",
          calcStats: [
            {
              stat: "岩崩れダメージ"
            }
          ]
        }
      ],
      skill         :
        {
          name     : "星落としの剣",
          desc     : `
大地の奥から荒星を上げ、爆発を起こし、岩元素範囲ダメージを与える。
荒星は岩元素創造物とみなされ、攻撃を防ぐことができ、登ることもできる。

長押し
スキルの発動位置を調整できる。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "岩潮幾重",
          desc     : `
大地の奥にある岩元素を活性化させ、拡散する振動波を引き起こす。
周囲の敵をノックバックし、岩元素範囲ダメージを与える。
振動波の外側に突出した環状の岩の山を生成する。
岩の山は岩元素創造物と見なされ、攻撃を防ぐことができる。`,
          calcStats: [
            {
              stat: "地震波1回のダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // ウェンティ
    "Venti": {
      constellations: [
        {
          name     : "矢先の蒼風",
          desc     : "狙い撃ちする時、分裂した矢を追加で2本放つ。それぞれ元の矢の33%のダメージを与える。",
          calcStats: [
            {
              stat: "分裂した矢のダメージ"
            },
            {
              stat: "分裂した矢のダメージ（フルチャージ）"
            }
          ]
        },
        {
          name: "恋い焦がれるそよ風",
          desc: "高天の歌発動後、敵の風元素耐性と物理耐性-12%、継続時間10秒。高天の歌によってノックバックされた敵が着地するまで、風元素耐性と物理耐性が更に-12%。"
        },
        {
          name: "千の風の詩",
          desc: "風神の詩のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "自由の凛風",
          desc: "ウェンティが元素オーブまたは元素粒子を獲得した時、風元素ダメージ+25%、継続時間10秒。"
        },
        {
          name: "高天の協奏",
          desc: "高天の歌のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "抗争の暴風",
          desc: "風神の詩のダメージを受けた敵の風元素耐性-20%。元素変化があった場合、変化した元素の耐性も-20%。"
        }
      ],
      passives      : [
        {
          name: "余風の法要",
          desc: "高天の歌を長押しした後、上昇気流が発生する、継続時間20秒。"
        },
        {
          name: "暴風の目",
          desc: "風神の詩効果終了後、ウェンティの元素エネルギーを15回復する。元素変化があった場合、該当元素のチームメンバーの元素エネルギーを15回復する。"
        }
      ],
      skill         :
        {
          name     : "高天の歌",
          desc     : `
詩を奏でる風を呼び、塵泥の中を歩くものを高空まで届ける。

一回押し
目標の足もとに風域を召喚し、風元素範囲ダメージを与え、敵をノックバックする。

長押し
自身を中心に更に大きい風域を召喚し、風元素範囲ダメージを与え、敵をノックバックする。
長押しで発動した後、ウェンティは風に乗り空中へ飛ぶ。
高天の歌にノックバックされた敵はゆっくりと落下する。`,
          calcStats: [
            {
              stat: "一回押しダメージ" // 公式
            },
            {
              stat: "長押しダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "風神の詩",
          desc     : `
千の風を集めた矢を放ち、前方に巨大な暴風の目を作る。爆風は敵を巻き込み、風元素ダメージを持続的に与える。

元素変化
暴風の目がスキル継続中に水元素/炎元素/氷元素/雷元素に接触すると、接触した元素の属性を獲得し、該当元素の付加ダメージを追加で与える。
元素変化はスキル継続中に1回のみ発生する。`,
          calcStats: [
            {
              stat: "継続ダメージ" // 公式
            },
            {
              stat: "付加元素ダメージ（炎）" // 半公式
            },
            {
              stat: "付加元素ダメージ（氷）" // 半公式
            },
            {
              stat: "付加元素ダメージ（水）" // 半公式
            },
            {
              stat: "付加元素ダメージ（雷）" // 半公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 香菱
    "Xiangling": {
      constellations: [
        {
          name: "外カリ中フワ",
          desc: "グゥオパァーに攻撃された敵の炎元素耐性-15%、継続時間6秒。"
        },
        {
          name     : "強火と油",
          desc     : "通常攻撃の最後の1撃で敵に2秒継続する爆縮効果を与える。効果終了時に爆発し、敵に攻撃力75%分の炎元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "爆縮効果ダメージ"
            }
          ]
        },
        {
          name: "武火調理",
          desc: "旋火輪のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "弱火でじっくり",
          desc: "旋火輪の継続時間+40%。"
        },
        {
          name: "凶猛なグゥオパァー",
          desc: "グゥオパァー出撃のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "竜巻旋火輪",
          desc: "旋火輪継続中、チーム全員の炎元素ダメージ+15%。"
        }
      ],
      passives      : [
        {
          name: "交差する炎",
          desc: "グゥオパァーの噴火距離+20%。"
        },
        {
          name: "激辛唐辛子",
          desc: "グゥオパァー出撃効果終了時、グゥオパァーは消えた位置に唐辛子を残す。唐辛子を拾うと、攻撃力+10%。継続時間10秒。"
        }
      ],
      skill         :
        {
          name     : "グゥオパァー出撃",
          desc     : "火を噴くグゥオパァーを召喚し、継続期間中に敵に火を噴き続け、炎元素範囲ダメージを与える。",
          calcStats: [
            {
              stat: "噴火ダメージ" // 公式
            }
          ]
        },
      burst         :
        {
          name     : "旋火輪",
          desc     : `
炎と槍をコントロールするコツで、自身を中心に素早く回転する旋火輪を投げ出す。
旋火輪はキャラクターと共に移動し、経路上の敵に炎元素ダメージを与える。`,
          calcStats: [
            {
              stat: "振り回し合計ダメージ"
            },
            {
              stat: "振り回しによる1段ダメージ" // 公式
            },
            {
              stat: "振り回しによる2段ダメージ" // 公式
            },
            {
              stat: "振り回しによる3段ダメージ" // 公式
            },
            {
              stat: "旋火輪ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 行秋
    "Xingqiu": {
      constellations: [
        {
          name: "すだれの残香",
          desc: "雨すだれの剣の最大本数+1。"
        },
        {
          name: "青空の虹",
          desc: "古華剣・裁雨留虹の継続時間+3秒。その他、剣雨攻撃を受けた敵の水元素耐性-15%、継続時間4秒。"
        },
        {
          name: "詩の錦",
          desc: "古華剣・裁雨留虹のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "孤舟斬蛟",
          desc: "古華剣・裁雨留虹継続中、古華剣・画雨籠山の与えるダメージ+50%。"
        },
        {
          name: "雨深閉門",
          desc: "古華剣・画雨籠山のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "万文ここにあり",
          desc: "古華剣・裁雨留虹が剣雨攻撃を2回発動する度に、次の剣雨攻撃が大幅に強化され、敵に命中する時行秋の元素エネルギーを3回復する。"
        }
      ],
      passives      : [
        {
          name     : "水生みの要訣",
          desc     : "雨すだれの剣が破壊、または継続時間終了時に、キャラクターのHPを行秋のHP上限の6%分回復する。",
          calcStats: [
            {
              stat: "回復量"
            }
          ]
        },
        {
          name: "虚実の筆",
          desc: "行秋の水元素ダメージ+20%。"
        }
      ],
      skill         :
        {
          name     : "古華剣・画雨籠山",
          desc     : `
2段連続の攻撃を仕掛け、前方の敵に水元素ダメージを与え、出場している自身のキャラクターの周りに最大本数の「雨すだれの剣」を生成する。
「雨すだれの剣」は以下の特徴を持つ:
・キャラクターが攻撃を受ける時、「雨すだれの剣」が破壊される代わりに、キャラクターが受けるダメージを減少させる。
・キャラクターの中断耐性をアップする。
行秋の水元素ダメージアップの20%分は「雨すだれの剣」のダメージ軽減効果に転換される。

最大24%のダメージ軽減効果を得られる。
「雨すだれの剣」の初期最大数は3本。
発動した瞬間、キャラクターに湿潤状態を付与する。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "古華剣・裁雨留虹",
          desc     : `
虹剣勢を展開し、幻影の剣雨を使い、キャラクターに最大数の雨すだれの剣を付与する。

虹剣勢
・出場している自身のキャラクターの通常攻撃時に剣雨攻撃を発動し、水元素ダメージを与える。
・雨すだれの剣の数は終始最大数をキープする。`,
          calcStats: [
            {
              stat: "剣雨のダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 鍾離
    "Zhongli": {
      constellations: [
        {
          name: "岩、天下の骨なり",
          desc: "地心の岩柱が同時に最大2つまで存在可能になる。"
        },
        {
          name: "石、玉の揺りかご",
          desc: "天星落下時、近くにいる出場中のキャラクターに玉璋シールドを付与する。"
        },
        {
          name: "圭璋、闇の中で輝く",
          desc: "地心のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "黄玉、破れぬ堅さ",
          desc: "天星の影響範囲+20%。さらに天星の石化効果の継続時間+2秒。"
        },
        {
          name: "璧、天理を守る",
          desc: "天星のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "金、天地の恵み",
          desc: "玉璋シールドがダメージを受けた時、そのダメージ量の40%分のHPを回復する。一回の回復上限はキャラクターのHP上限の8%。"
        },
      ],
      passives      : [
        {
          name: "岩の宸断",
          desc: "玉璋シールドはダメージを受けた際に防御効果を発動する。玉璋シールドに守られたキャラクターのシールド強化+5%。シールドが消えるまで、最大5回強度を上げることができる。"
        },
        {
          name     : "贅沢な食饌",
          desc     : `
HP上限を基に、鍾離の下記攻撃のダメージが増加する。
・通常攻撃、重撃と落下攻撃のダメージ増加量: HP上限の1.39%
・地心の岩柱、共鳴と長押しダメージ増加量: HP上限の1.9%
・天星ダメージ増加量: HP上限の33%`,
          calcStats: [
            {
              stat: "天星ダメージ増加量"
            }
          ]
        },
      ],
      skill         : {
        name     : "地心",
        desc     : `
一回押し
大地の至るところにある岩元素を積み上げ、岩柱を生成する。

長押し
付近の岩元素を爆発させ、下記の効果を発動する:
・岩柱が数の上限に達していない場合、岩柱を生成する。
・玉璋シールドを生成する。シールドのダメージ吸収量は鍾離のHP上限によって決まる。
・岩元素範囲ダメージを与える。
・周りに岩元素を持つターゲットがいる場合、最大2つのターゲットの岩元素を大量に消耗させる。この効果によるダメージは発生しない。

岩柱
が生成された時、岩元素範囲ダメージを与える。
また、岩柱が存在している間、周囲の他の岩元素創造物と一定時間の間隔で原岩共鳴をし、持続的に周囲の敵に岩元素ダメージを与える。
岩柱は岩元素創造物と見なされ、攻撃を防ぐことができ、登ることもできる。同時に最大1つまで存在可能。

玉璋シールド
全元素ダメージと物理ダメージに150%の吸収効果がある。
玉璋シールドに守られたキャラクターは、付近範囲内の敵の全元素耐性と物理耐性-20%。この効果は重ねがけ不可。`,
        calcStats: [
          {
            stat: "岩柱ダメージ" // 公式
          },
          {
            stat: "共鳴ダメージ" // 公式
          },
          {
            stat: "長押しダメージ" // 公式
          },
          {
            stat: "シールド吸収量" // 半公式
          }
        ]
      },
      burst         : {
        name     : "天星",
        desc     : `
巨大な星岩を落下させ、落下範囲内の敵に大量の岩元素ダメージを与え、石化状態にする。

石化
石化状態の敵は行動不能になる。`,
        calcStats: [
          {
            stat: "元素爆発ダメージ" // 公式「スキルダメージ」
          },
          {
            stat: "元素爆発ダメージ（贅沢な食饌効果を含む）"
          },
          {
            stat: "元素エネルギー" // 公式
          }
        ]
      }
    },

    // 辛炎
    "Xinyan": {
      constellations: [
        {
          name: "絶命の加速",
          desc: "会心攻撃が発生した5秒間、通常攻撃と重撃の攻撃速度+12%。5秒毎に1回のみ発動可能。"
        },
        {
          name: "オープニング演出",
          desc: "反逆の弾きによる物理ダメージの会心率+100%。さらに発動する時にLv.3シールド・舞のリズムを生成する。",
        },
        {
          name: "摭分の運指",
          desc: "情熱の薙ぎ払いのスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "リズムの伝染",
          desc: "情熱の薙ぎ払いの振り回しダメージを受けた敵の物理耐性-15%、継続時間12秒。"
        },
        {
          name: "アンコールの叫び",
          desc: "反逆の弾きのスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "地獄のシェーク",
          desc: "辛炎の重撃によるスタミナ消費-30%。重撃を発動する時、辛炎の防御力50%分の攻撃力が増加する。"
        },
      ],
      passives      : [
        {
          name: "「観客いなくても演奏するのだ…」",
          desc: `
情熱の薙ぎ払いのシールド発動に必要な命中数を減少する:
・Lv.2シールド・指揮のリズム: 1名の敵に命中する。
・Lv.3シールド・舞のリズム: 2名の敵に命中する。`
        },
        {
          name: "「…これこそがロックだ!」",
          desc: "情熱の薙ぎ払いのシールドが存在する時、キャラクターが与える物理ダメージ+15%。"
        }
      ],
      skill         : {
        name     : "情熱の薙ぎ払い",
        desc     : `
楽器を振り回し、周囲の敵に炎元素ダメージを与え、「観客」の「情熱」でシールドを生成する。
シールドのダメージ吸収量は辛炎の防御力によって決まり、シールドのレベルは命中した敵の数によって変わる。
・敵に命中しなかった又は1名の敵に命中した場合: Lv.1シールド・イントロのリズム
・2名の敵に命中した場合: Lv.2シールド・指揮のリズム
・3名またはそれ以上の敵に命中した場合: Lv.3シールド・舞のリズムを生成する。シールドはダメージを吸収するほか、一定時間の間隔で周囲の敵に炎元素ダメージを与える。

シールドは以下の特性を持つ:
・発動する時、辛炎に炎元素付着を与える。
・炎元素ダメージに対して、250%の吸収効果がある。`,
        calcStats: [
          {
            stat: "振り回しダメージ" // 公式
          },
          {
            stat: "継続ダメージ" // 公式
          },
          {
            stat: "Lv.1シールド吸収量" // 公式
          },
          {
            stat: "Lv.2シールド吸収量" // 公式
          },
          {
            stat: "Lv.3シールド吸収量" // 公式
          }
        ]
      },
      burst         : {
        name     : "反逆の弾き",
        desc     : `
弦を素早く弾き、音波を放出して敵をノックバックする。周囲の敵に物理ダメージを与え、「舞台」の雰囲気を盛り上げる。
雰囲気が熱さが烈焔を引き起こし、周囲の敵に炎元素ダメージを持続的に与える。`,
        calcStats: [
          {
            stat: "元素爆発ダメージ" // 公式「スキルダメージ」
          },
          {
            stat: "継続炎元素ダメージ" // 公式
          },
          {
            stat: "元素エネルギー" // 公式
          }
        ]
      },
    },

    // 魈
    "Xiao": {
      constellations: [
        {
          name: "壊却・三界破壊",
          desc: "風輪両立の使用可能回数+1。"
        },
        {
          name: "空却・虚空開敷の変",
          desc: "フィールド上にいない時、魈自身の元素チャージ効率+25%。"
        },
        {
          name: "降魔・憤怒の相",
          desc: "風輪両立のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "神通・諸苦滅尽",
          desc: "魈のHPが50%未満の時、防御力+100%。"
        },
        {
          name: "成却・無明増長",
          desc: "靖妖儺舞のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "降魔・護法夜叉",
          desc: "靖妖儺舞状態の時、落下攻撃が2体以上の敵に命中すると、風輪両立の使用回数+1。その後の1秒間以内は、クールタイム関係なく風輪両立を発動できる。"
        }
      ],
      passives      : [
        {
          name: "降魔・平妖大聖",
          desc: "靖妖儺舞状態の時、魈の与える全ダメージ+5%。また、スキル継続中、3秒毎に与える全ダメージが更に+5%。最大25%まで。"
        },
        {
          name: "壊却・国土砕き",
          desc: "風輪両立発動後の7秒間、風輪両立によるダメージ+15%。継続時間7秒、最大3重まで、重複で発動すると継続時間がリセットされる。"
        }
      ],
      skill         :
        {
          name     : "風輪両立",
          desc     : `
疾速突進し、経路上の敵に風元素ダメージを与える。
空中での発動が可能。
初期使用可能回数2回。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      burst         :
        {
          name     : "靖妖儺舞",
          desc     : `
数千年前に妖魔たちに恐れられた夜叉の儺面を見せる。

夜叉の儺面
・魈のジャンプ力が大幅にアップする。
・攻撃範囲が広がり、与えるダメージが上昇する。
・攻撃ダメージは風元素ダメージとなり、元素付与によって他の元素に変化することはない。

この状態の魈は、HPが持続的に減少する。
この効果は魈が退場する時に解除される。`,
          calcStats: [
            {
              stat: "HP減少" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    },

    // 甘雨
    "Ganyu": {
      "constellations": [
        {
          name: "飲露",
          desc: "二段チャージ重撃の霜華の矢または霜華満開が命中した時、敵の氷元素耐性-15%。継続時間6秒。命中時に甘雨の元素エネルギーを2回復。二段チャージの重撃による元素エネルギーの回復効果は、1回の重撃で1度のみ発動可能。"
        },
        {
          name: "獲麟",
          desc: "山沢麟跡の発動回数+1。"
        },
        {
          name: "雲行",
          desc: "降衆天華のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "西狩",
          desc: "降衆天華エリア内、敵の受けるダメージが増加する。受けるダメージの増加量は初期が5%、3秒毎に5%上昇し、最大25%まで上昇する。エリアを出た後、継続時間3秒。"
        },
        {
          name: "折草",
          desc: "山沢麟跡のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "履虫",
          desc: "山沢麟跡を発動すると、30秒以内に放つ最初の霜華の矢が、チャージせずに発動可能になる。"
        }
      ],
      "passives"      : [
        {
          name: "唯一の心",
          desc: "霜華の矢を放った後の5秒以内に放たれた霜華の矢と霜華満開の会心率+20%。"
        },
        {
          name: "天地安泰",
          desc: "降衆天華エリア内のキャラクターの氷元素ダメージ+20%。"
        }
      ],
      "skill"         :
        {
          name     : "山沢麟跡",
          desc     : `
一輪の氷蓮を残して後退し、全ての魑魅魍魎から離れ、氷元素範囲ダメージを与える。

氷蓮
・持続的に周囲の敵を挑発し、攻撃を引き付ける。
・耐久度は甘雨のHP上限によって決まる。
・破壊された時または継続時間終了後に激しく開花し、氷属性範囲ダメージを与える。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "HP継承" // 公式
            }
          ]
        },
      "burst"         :
        {
          name     : "降衆天華",
          desc     : `
大気中の霜雪を集め、退魔の氷霊珠を召喚する。
氷霊珠が存在している間、持続的に氷柱を降らし、範囲内の敵に氷元素ダメージを与える。`,
          calcStats: [
            {
              stat: "氷柱ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        },
      "extras"        : {
        calcStats:
          [
            {
              stat: "霜華の矢の命中ダメージ" // 公式
            },
            {
              stat: "霜華の矢・霜華満開ダメージ" // 公式
            }
          ]
      }
    },

    // アルベド
    "Albedo": {
      "constellations": [
        {
          name: "エデンの花",
          desc: "アルベドの創生術・疑似陽華の刹那の花が放たれた時、アルベド自身の元素エネルギーが1.2回復する。"
        },
        {
          name: "顕生の宇宙",
          desc: `
創生術・疑似陽華の刹那の花が放たれた時、アルベドに生滅カウントを付与する。継続時間30秒。
・誕生式・大地の潮を発動する時、全ての生滅カウントを取り除く。取り除かれた数によって、誕生式・大地の潮の爆発ダメージと生滅の花のダメージが上昇する。
・生滅カウント1つにつき、アルベドの防御力30%分のダメージが上昇する。
生滅カウントは最大4重まで。`
        },
        {
          name: "太陽の華",
          desc: "創生術・疑似陽華のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "聖なる墜落",
          desc: "陽華のエリア内にいるキャラクターの落下攻撃ダメージ+30%。"
        },
        {
          name: "太古の潮",
          desc: "誕生式・大地の潮のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "無垢なる土",
          desc: "陽華のエリア内にいるフィールド上のキャラクターが、結晶反応で生成されたシールド状態にある時、与えるダメージ+17%。"
        }
      ],
      "passives"      : [
        {
          name: "白亜色の気迫",
          desc: "創生術・擬似陽華の刹那の花がHP50%未満の敵にダメージを与えた場合、ダメージ量+25%。"
        },
        {
          name: "ホムンクルスの天智",
          desc: "誕生式・大地の潮を発動した時、周囲のチーム全員の元素熟知を+125、継続時間10秒。"
        }
      ],
      "skill"         :
        {
          name     : "創生術・擬似陽華",
          desc     : `
陽華を錬成し、岩元素範囲ダメージを与える。

陽華
陽華は以下の特性を持つ:
・陽華を中心とするエリア内にいる敵がダメージを受けた時、陽華は刹那の花を生成し、敵に岩元素範囲ダメージを与えるダメージ量はアルベドの防御力によって決まる。
・刹那の花は2秒毎に1回のみ生成できる。
・キャラクターが陽華の上にいる時、陽華は岩元素の力を凝結し、キャラクターを一定の高さまで持ち上げる晶台を生成する。晶台は同時に最大1つまで存在可能。
・アルベドによって創造された陽華は同時に最大1つまで存在可能。また、陽華は岩元素創造物とみなされる。

長押し
スキルの発動位置を調整できる。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "刹那の花ダメージ" // 公式
            }
          ]
        },
      "burst"         :
        {
          name     : "誕生式・大地の潮",
          desc     : `
アルベドの指示の下、岩晶が激しく爆発しアルベドの前方に岩元素範囲ダメージを与える。
フィールド上にアルベドが創造した陽華が存在している場合、陽華のエリア内に7本の生滅の花を生成し、岩元素範囲ダメージを与える。

爆発と生滅の花によるダメージによって刹那の花が作られることはない。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「爆発ダメージ」
            },
            {
              stat: "生滅の花ダメージ" // 公式
            }
          ]
        }
    },

    // 胡桃
    "Hutao": {
      "constellations": [
        {
          name: "朱色の花束",
          desc: "蝶導来世による冥蝶の舞状態の時、胡桃の重撃はスタミナを消費しない。"
        },
        {
          name: "晴れのち雨",
          desc: "血梅香のダメージ量が胡桃のHP上限の10%分上昇する。また、安神秘法は命中した敵に血梅香効果を与える。"
        },
        {
          name: "血色の儀",
          desc: "蝶導来世のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "花室の添い寝",
          desc: "胡桃自ら与えた血梅香状態の敵が倒されると、周囲のチーム全員(胡桃自身を除く)の会心率+12%、継続時間15秒。"
        },
        {
          name: "漂う花の香り",
          desc: "安神秘法のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "冥蝶の抱擁",
          desc: `
胡桃のHPが25%以下、または戦闘不能に至るダメージを受けた時に発動:
このダメージで胡桃が戦闘不能になることはない。また、次の10秒間、胡桃の全元素耐性及び物理耐性+200%、会心率+100%、中断耐性大幅アップ。
この効果は胡桃のHPが1の時に自動で発動される。
60秒毎に1回のみ発動可能。`
        }
      ],
      "passives"      : [
        {
          name: "蝶隠の時",
          desc: "蝶導来世による冥蝶の舞状態終了後、チーム全員(胡桃自身を除く)の会心率+12%、継続時間8秒。"
        },
        {
          name: "血のかまど",
          desc: "胡桃のHPが50%以下の時、炎元素ダメージ+33%。"
        }
      ],
      "skill"         :
        {
          name     : "蝶導来世",
          desc     : `
燃え続ける炎のみが、この世の不浄を払うことができる。
一定のHPを消費して、周囲の敵をノックバックし、冥蝶の舞状態に入る。

冥蝶の舞
・胡桃のHP上限を基準に攻撃力が上昇する。この効果で得られる攻撃力上昇の最大値は、胡桃の基礎攻撃力の400%まで。
・攻撃ダメージは炎元素ダメージとなり、元素付与によって他の元素に変化することはない。
・重撃は敵に血梅香効果を与える。
・胡桃の中断耐性が上昇する。

血梅香
血梅香状態の敵は、4秒毎に1度、炎元素ダメージを受ける。このダメージは元素スキルダメージと見なされる。
同一ターゲットに付与される血梅香効果は同時に最大1つまで。また、血梅香効果の継続時間は効果を付与した胡桃だけが更新可能。

冥蝶の舞は継続時間終了時、または胡桃の退場や戦闘不能時に解除される。`,
          calcStats: [
            {
              stat: "血梅香ダメージ" // 公式
            }
          ]
        },
      "burst"         :
        {
          name     : "安神秘法",
          desc     : `
灼熱の魂を振り回し、広範囲に炎元素ダメージを与える。
敵に命中した時、胡桃のHP上限を基準に自身のHPが回復する。この効果は命中した敵1体毎に発動し、最大で5体まで効果が発動する。
胡桃のHPが50%以下の時、より高いダメージと回復効果を持つ。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "低HP時 元素爆発ダメージ" // 公式「低HP時スキルダメージ」
            },
            {
              stat: "元素爆発回復量" // 公式「スキル回復量」
            },
            {
              stat: "低HP時 元素爆発回復量" // 公式「低HP時スキル回復量」
            }
          ]
        }
    },

    // ロサリア
    "Rosaria": {
      "constellations": [
        {
          name: "罪の導き",
          desc: "ロサリアの攻撃で会心が発生すると、攻撃速度+10%、通常攻撃のダメージ+10%、継続時間4秒。"
        },
        {
          name: "無福の地",
          desc: "臨終の聖礼で創られる氷槍の継続時間+4秒。"
        },
        {
          name: "懺悔の儀",
          desc: "罪喰いの懺悔のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "苦痛の恩典",
          desc: "罪喰いの懺悔で会心が発生すると、ロサリア自身の元素エネルギーが5回復する。この効果は、1回の罪喰いの懺悔で1度のみ発動可能。"
        },
        {
          name: "臨終の祈り",
          desc: "臨終の聖礼のスキルLv.+3。最大Lv.15まで。"
        },
        {
          name: "代行裁判",
          desc: "臨終の聖礼を発動すると、敵の物理耐性-20%、継続時間10秒。"
        }
      ],
      "passives"      : [
        {
          name: "懺悔に耳を傾ける幻影",
          desc: "罪喰いの懺悔で敵の背後から攻撃すると、ロサリアの会心率+12%、継続時間5秒。"
        },
        {
          name: "陰から支える暗色",
          desc: "臨終の聖礼発動時、自身の会心率の15%分、チーム全員(ロサリア自身を除く)の会心率をアップさせる、継続時間10秒。この方法で獲得できる会心率アップ効果は、最大15%まで。"
        }
      ],
      "skill"         :
        {
          name     : "罪喰いの懺悔",
          desc     : `
素早く敵の背後に回り込み、長槍で突きと振り降ろしを繰り出すことで、氷元素ダメージを与える。
このスキルは、大きな体形を持つ敵の背後に回り込むことはできない。`,
          calcStats: [
            {
              stat: "元素スキルダメージ" // 公式「スキルダメージ」
            }
          ]
        },
      "burst"         :
        {
          name     : "臨終の聖礼",
          desc     : `
ロサリア専属の祈りの儀式。武器を振り周囲の敵を攻撃した後、極寒を蓄積した氷槍を地面に差し込み、氷元素ダメージを与える。
氷槍が存在している間、定期的に冷気を発散し、近くの敵に氷元素ダメージを与える。`,
          calcStats: [
            {
              stat: "元素爆発ダメージ" // 公式「スキルダメージ」
            },
            {
              stat: "氷槍継続ダメージ" // 公式
            },
            {
              stat: "元素エネルギー" // 公式
            }
          ]
        }
    }
  },

  weaponData: {
    "Messenger"         : "文使い",
    "Raven Bow"         : "鴉羽の弓",
    "Recurve Bow"       : "リカーブボウ",
    "Sharpshooters Oath": "シャープシューターの誓い",
    "Slingshot"         : "弾弓",

    "Emerald Orb"                      : "翡玉法珠",
    "Magic Guide"                      : "魔導緒論",
    "Otherworldly Story"               : "異世界旅行記",
    "Thrilling Tales of Dragon Slayers": "龍殺しの英傑譚",
    "Twin Nephrite"                    : "特級の宝玉",

    "Bloodtainted Greatsword": "龍血を浴びた剣",
    "Debate Club"            : "理屈責め",
    "Ferrous Shadow"         : "鉄影段平",
    "Skyrider Greatsword"    : "飛天大御剣",
    "White Iron Greatsword"  : "白鉄の大剣",

    "Black Tassel": "黒纓槍",
    "Halberd"     : "鉾槍",
    "White Tassel": "白纓槍",

    "Cool Steel"           : "冷刃",
    "Dark Iron Sword"      : "暗鉄剣",
    "Fillet Blade"         : "チ虎魚の刀",
    "Harbinger of Dawn"    : "黎明の神剣",
    "Skyrider Sword"       : "飛天御剣",
    "Travelers Handy Sword": "旅道の剣",

    "Alley Hunter"        : "ダークアレイの狩人",
    "Blackcliff Warbow"   : "黒岩の戦弓",
    "Compound Bow"        : "リングボウ",
    "Favonius Warbow"     : "西風猟弓",
    "Prototype Crescent"  : "澹月・試作",
    "Royal Bow"           : "旧貴族の長弓",
    "Rust"                : "弓蔵",
    "Sacrificial Bow"     : "祭礼の弓",
    "The Stringless"      : "絶弦",
    "The Viridescent Hunt": "蒼翠の狩猟弓",
    "Windblume Ode"       : "風花の頌歌",

    "Blackcliff Agate"     : "黒岩の緋玉",
    "Eye of Perception"    : "昭心",
    "Favonius Codex"       : "西風秘典",
    "Mappa Mare"           : "万国諸海の図譜",
    "Prototype Amber"      : "金珀・試作",
    "Royal Grimoire"       : "旧貴族秘法録",
    "Sacrificial Fragments": "祭礼の断片",
    "Solar Pearl"          : "匣中日月",
    "The Widsith"          : "流浪楽章",
    "Wine and Song"        : "ダークアレイの酒と詩",

    "Blackcliff Slasher"    : "黒岩の斬刀",
    "Favonius Greatsword"   : "西風大剣",
    "Lithic Blade"          : "千岩古剣",
    "Prototype Archaic"     : "古華・試作",
    "Rainslasher"           : "雨裁",
    "Royal Greatsword"      : "旧貴族大剣",
    "Sacrificial Greatsword": "祭礼の大剣",
    "Serpent Spine"         : "螭龍の剣",
    "The Bell"              : "鐘の剣",
    "Whiteblind"            : "白影の剣",
    "Sword of Descension"   : "降臨の剣",

    "Blackcliff Pole"      : "黒岩の突槍",
    "Crescent Pike"        : "流月の針",
    "Deathmatch"           : "死闘の槍",
    "Dragons Bane"         : "匣中滅龍",
    "Favonius Lance"       : "西風長槍",
    "Lithic Spear"         : "千岩長槍",
    "Prototype Starglitter": "星鎌・試作",
    "Royal Spear"          : "旧貴族猟槍",

    "Blackcliff Longsword": "黒岩の長剣",
    "Favonius Sword"      : "西風剣",
    "Iron Sting"          : "鉄蜂の刺し",
    "Lions Roar"          : "匣中龍吟",
    "Prototype Rancour"   : "斬岩・試作",
    "Royal Longsword"     : "旧貴族長剣",
    "Sacrificial Sword"   : "祭礼の剣",
    "The Alley Flash"     : "ダークアレイの閃光",
    "The Black Sword"     : "黒剣",
    "The Flute"           : "笛の剣",

    "Amos Bow"            : "アモスの弓",
    "Skyward Harp"        : "天空の翼",
    "Dreams of Dragonfell": null,
    "Elegy for the End"   : "終焉を嘆く詩",

    "Lost Prayer to the Sacred Winds": "四風原典",
    "Skyward Atlas"                  : "天空の巻",
    "Memory of Dust"                 : "浮世の錠",

    "Skyward Pride"   : "天空の傲",
    "Wolfs Gravestone": "狼の末路",
    "The Unforged"    : "無工の剣",

    "Kunwus Iris Rift"            : null,
    "Primordial Jade Winged-Spear": "和璞鳶",
    "Skyward Spine"               : "天空の脊",
    "Vortex Vanquisher"           : "破天の槍",
    "Staff of Homa"               : "護摩の杖",

    "Aquila Favonia"        : "風鷹剣",
    "Summit Shaper"         : "斬山の刃",
    "Skyward Blade"         : "天空の刃",
    "Primordial Jade Cutter": "磐岩結緑",

    "Snow-Tombed Starsilver": "雪葬の星銀",
    "Dragonspine Spear"     : "ドラゴンスピア",
    "Frostbearer"           : "冬忍びの実",
    "Festering Desire"      : "腐植の剣"
  },

  weaponAbilityData: {
    // 矢文（文使い）
    "Archers Message": {
      desc: "重撃が弱点に命中した場合、追加で攻撃力100/125/150/175/200%のダメージを与え、必ず会心ダメージとなる。10秒に1回のみ発動可能。"
    },
    // 炎と水の破滅（鴉羽の弓）
    "Bane of Flame and Water": {
      desc: "水元素または炎元素の影響を受けた敵に対するダメージ+12/15/18/21/24%。"
    },
    // 刈り取る（リカーブボウ、白鉄の大剣）
    "Cull the Weak": {
      desc: "敵を倒したとき、HPを8/10/12/14/16%回復する。"
    },
    // 精密射撃（シャープシューターの誓い）
    "Precise": {
      desc: "弱点に対するダメージ+24/30/36/42/48%。"
    },
    // 弾弓（弾弓）
    "Slingshot": {
      desc: "通常攻撃または重撃の矢が発射した後、0.3秒以内に敵に命中した場合、与えるダメージ+36/42/48/54/60%。0.3秒以上の場合、与えるダメージ-10%。"
    },
    // 激流（翡玉法珠）
    "Rapids": {
      desc: "蒸発、感電、凍結、または水元素拡散反応を起こした後12秒間、攻撃力+20/35/30/35/40%。"
    },
    // 水と雷の破滅（魔導緒論）
    "Bane of Storm and Tide": {
      desc: "水元素または雷元素の影響を受けた敵に対するダメージ+12/15/18/21/24%。"
    },
    // エネルギーシャワー（異世界旅行記）
    "Energy Shower": {
      desc: "元素オーブまたは元素粒子を獲得した時、HPを1/1.25/1.5/1.75/2%回復する。"
    },
    // 伝承（竜殺しの英傑譚）
    "Legacy": {
      desc: "キャラを切り替えると、次に登場するキャラの攻撃力+24/30/36/42/48%、継続時間10秒。20秒に1回のみ発動可能。"
    },
    // 襲撃戦術（特級の宝玉）
    "Guerilla Tactic": {
      desc: "敵を倒した後15秒間、移動速度と攻撃力+12/14/16/18/20%。"
    },

    // 炎と雷の破滅（龍血を浴びた剣）
    "Bane of Fire and Thunder": {
      desc: "炎元素または雷元素の影響を受けた敵に対するダメージ+12/15/18/21/24%。"
    },
    // 率直に話を言え（理屈責め）
    "Blunt Conclusion": {
      desc: "元素スキルを発動した後、通常攻撃と重撃が命中する際に、狭範囲で攻撃力の60/75/90/105/120%のダメージを与える、継続時間15秒、ダメージは3秒毎に1回のみ発動可能。"
    },
    // 不服（鉄影段平）
    "Unbending": {
      desc: "HPが70/75/80/85/90%以下になると、重撃は中断されにくくなり、更に重撃ダメージ+30/35/40/45/50%。"
    },
    // 勇気（飛天大御剣）
    "Courage": {
      desc: "通常攻撃と重撃が命中すると、攻撃力+6/7/8/9/10%、継続時間6秒、最大4重まで。0.5秒毎に1回のみ発動可能。"
    },

    // スライム殺し（黒纓槍）
    "Bane of the Soft": {
      desc: "スライムタイプの敵に対するダメージ+40/50/60/70/80%。"
    },
    // 過重（鉾槍）
    "Heavy": {
      desc: "通常攻撃が命中した敵1体に攻撃力の160/200/240/280/320%の追加ダメージを与える。10秒毎に1回のみ発動可能。"
    },
    // 鋭利（白纓槍）
    "Sharp": {
      desc: "通常攻撃のダメージ+24/30/36/42/48%。"
    },

    // 水と氷の破滅（冷刃）
    "Bane of Water and Ice": {
      desc: "水元素または氷元素の影響を受けた敵に対するダメージ+12/15/18/21/24%。"
    },
    // オーバーロード（暗鉄剣）
    "Overloaded": {
      desc: "過負荷、超伝導、感電または雷元素拡散反応が発生した12秒間、攻撃力+20/25/30/35/40%。"
    },
    // 切り捨て（チ虎魚の刀）
    "Gash": {
      desc: "攻撃が命中すると、50%の確率で1体の敵に攻撃力の240/280/320/360/400%のダメージを与える。15/14/13/12/11秒に1回のみ発動可能。"
    },
    // 奮い立てる（黎明の神剣）
    "Vigorous": {
      desc: "HPが90%以上の時、会心率+14/18/22/24/28%。"
    },
    // 決心（飛天御剣）
    "Determination": {
      desc: "元素爆発を発動した後、攻撃力と移動速度+12/15/18/21/24%、継続時間15秒。"
    },
    // 旅路（旅道の剣）
    "Journey": {
      desc: "元素オーブまたは元素粒子を獲得した時、HPを1/1.25/1.5/1.75/2%回復する。"
    },

    // 路地奇襲（ダークアレイの狩人）
    "Urban Guerrilla": {
      desc: "この武器を装備したキャラクターが待機している時、1秒ごとに自身の与えるダメージ+2/2.5/3/3.5/4%。この方式で獲得できるダメージアップ効果は20/25/30/35/40%まで。4秒以上フィールド上にいると、上記ダメージアップ効果は0%になるまで、1秒毎に4/5/6/7/8%ダウンする。"
    },
    // 勝ちに乗じる（黒岩の長剣、黒岩の斬刀、黒岩の突槍、黒岩の緋玉、黒岩の戦弓）
    "Press the Advantage": {
      desc: "敵を倒した後、攻撃力+12/15/18/21/24%、継続時間30秒、最大3重まで。効果継続時間は重毎に別々でカウントされる。"
    },
    // 注入の矢（リングボウ）
    "Infusion Arrow": {
      desc: "通常攻撃と重撃が命中する時、攻撃力+4/5/6/7/8%、通常攻撃速度+1.2/1.5/1.8/2.1/2.4%、継続時間6秒、最大4重まで。0.3秒に1回のみ発動可能。"
    },
    // 追い風が吹く（西風猟弓、西風大剣、西風長槍、西風剣、西風秘典）
    "Windfall": {
      desc: "会心攻撃をした時、60/70/80/90/100%の確率で少量の元素粒子を生成し、元素エネルギーを6回復する。12/10.5/9/7.5/6秒毎に1回のみ発動可能。"
    },
    // 帰らない（澹月・試作）
    "Unreturning": {
      desc: "重撃が弱点に命中した場合、移動速度+10%、攻撃力+36/45/54/63/72%、継続時間10秒。"
    },
    // 集中（旧貴族長剣、旧貴族の大剣、旧貴族の猟槍、旧貴族の秘法録、旧貴族の長弓）
    "Focus": {
      desc: "攻撃が敵にダメージを与えた時、会心率+8/10/12/14/16%、最大5重まで。攻撃会心発生時、効果をクリアにする。"
    },
    // 速射の弓（弓蔵）
    "Rapid Firing": {
      desc: "通常攻撃のダメージ+40/50/60/70/80%、重撃のダメージ-10%"
    },
    // 落ち着き（祭礼の弓、祭礼の大剣）
    "Composed": {
      desc: "元素スキルが敵にダメージを与えた時、40/50/60/70/80%の確率で該当スキルのクールタイムをリセットする。30/26/22/18/14秒毎に1回のみ発動可能。"
    },
    // 矢なしの詩（絶弦）
    "Arrowless Song": {
      desc: "元素スキルと元素爆発のダメージ+24/30/36/42/48%"
    },
    // 蒼翠の風（蒼翠の狩猟弓）
    "Verdant Wind": {
      desc: "通常攻撃と重撃が命中時、50%の確率で風の目を生成し、近くの敵を吸い寄せる。0.5秒毎に敵に攻撃力の40/50/60/70/80%のダメージを与える。継続時間4秒、14/13/12/11/10秒ごとに1回のみ発動可能。"
    },
    // 風花の願い（風花の頌歌）
    "Windblume Wish": {
      desc: "元素スキルを発動した後、風の花の悠久なる願いの加護を獲得し、攻撃力+16/20/24/28/32%、持続時間6秒。"
    },

    // 響き（昭心）
    "Echo": {
      desc: "通常攻撃と重撃が命中する時、50%の確率で昭心法珠を一つ発射し、敵に攻撃力の240/270/300/330/360%のダメージを与える。敵同士に最大4回跳ね返る。この効果は12/11/10/9/8秒毎に1回のみ発動可能。"
    },
    // 注入の巻（万国諸海の図譜）
    "Infusion Scroll": {
      desc: "元素反応を起こした後、元素ダメージ+8/10/12/14/16%、継続時間10秒、最大2重まで。"
    },
    // 炊金（金珀・試作）
    "Gilding": {
      desc: "元素爆発を発動した後の6秒間、2秒毎に元素エネルギーを4/4.5/5/5.5/6回復し、チーム全員のHPを2秒毎に4/4.5/5/5.5/6%回復する。"
    },
    // 日月の輝き（匣中日月）
    "Solar Shine": {
      desc: "通常攻撃が命中した後、6秒間元素スキルと元素爆発のダメージ+20/25/30/35/40%。元素スキルまたは元素爆発が命中した後、6秒間通常攻撃のダメージ+20/25/30/35/40%。"
    },
    // 序曲（流浪楽章）
    "Debut": {
      desc: "キャラ登場時、ランダムにテーマ曲を1つ獲得する、継続時間10秒。30秒毎に1回のみ発動可能。叙唱: 攻撃力+60/75/90/105/120%。詠唱: 全元素ダメージ+48/60/72/84/96%。間奏曲: 元素熟知+240/300/360/420/480。"
    },
    // 千変万化（ダークアレイの酒と詩）
    "Wind in the Square": {
      desc: "通常攻撃が敵に命中すると、ダッシュまたはダッシュを代替する能力のスタミナ消費-14/16/18/20/22%、持続時間5秒。また、ダッシュまたはダッシュを代替する能力を使用すると、攻撃力+20/25/30/35/40%、持続時間5秒。"
    },

    // 千岩訣・同心（千岩古剣、千岩長槍）
    "Lithic Axiom - Unity": {
      desc: "チームに璃月出身のキャラクターが1人いる毎に、この武器を装備したキャラクターの攻撃力+7/8/9/10/11%、会心率+3/4/5/6/7%。最大4重まで。"
    },
    // 粉砕（古華・試作）
    "Crush": {
      desc: "通常攻撃と重撃が命中する時、50%の確率で狭範囲の敵に攻撃力の240/300/360/420/480%の追加ダメージを与える。15秒毎に1回のみ発動可能。"
    },
    // 水と雷の破滅（雨裁）
    "Bane of Storm and Tide2": {
      desc: "水元素または雷元素の影響を受けた敵に対するダメージ+20/24/28/32/36%。"
    },
    // 波乗り（螭龍の剣）
    "Wavesplitter": {
      desc: "フィールドにいる時、4秒毎に、与えるダメージ+6/7/8/9/10%、被ダメージ+3/2.7/2.4/2.1/1.8%。最大5重まで、退場後もリセットされず、攻撃を受けると効果数-1。"
    },
    // 反逆の守護者（鐘の剣）
    "Rebellious Guardian": {
      desc: "ダメージを受けた時、HP上限の20/23/26/29/32%に相当するダメージを吸収できるシールドを生成する。継続時間は最大10秒まで。45秒の毎に1回のみ発動する。シールドが存在する時、キャラクターの与えるダメージ+12/15/18/21/24%。"
    },
    // 注入の刃（白影の剣）
    "Infusion Blade": {
      desc: "通常攻撃と重撃が命中すると、攻撃力と防御力+6/7.5/9/10.5/12%、継続時間6秒、最大4重まで。0.5秒毎に1回のみ発動可能。"
    },

    // 注入の針（流月の針）
    "Infusion Needle": {
      desc: "元素粒子または元素オーブを獲得した5秒間、通常攻撃と重撃で、攻撃力の20/25/30/35/40%の追加ダメージを与える。"
    },
    // 剣闘士（死闘の槍）
    "Gladiator": {
      desc: "近くに敵が2人以上いる時、攻撃力+16/20/24/28/32%、防御力+16/20/24/28/32%。近くに敵が2人未満の時、攻撃力+24/30/36/42/48%。"
    },
    // 炎と水の破滅（匣中滅龍）
    "Bane of Flame and Water2": {
      desc: "水元素または炎元素の影響を受けた敵に対するダメージ+20/24/28/32/36%。"
    },
    // "Lithic Axiom - Subjugating Evil": {
    //   desc: null
    // },
    // 魔力親和（星鎌・試作）
    "Magic Affinity": {
      desc: "元素スキルを発動した後、通常攻撃と重撃のダメージ+8/10/12/14/16%、継続時間12秒、最大2重まで。"
    },

    // 注入の棘（鉄蜂の刺し）
    "Infusion Stinger": {
      desc: "元素ダメージを与えた6秒間、キャラの与えるダメージ+6/7.5/9/10.5/12%、最大2重まで。1秒毎に1回のみ発動可能。"
    },
    // 炎と雷の破滅（匣中龍吟）
    "Bane of Fire and Thunder2": {
      desc: "炎元素または雷元素の影響を受けた敵に対するダメージ+20/24/28/32/36%。"
    },
    // 岩砕き（斬岩・試作）
    "Smashed Stone": {
      desc: "通常攻撃または重撃が命中すると、攻撃力と防御力+4/5/6/7/8%、継続時間6秒、最大4重まで。0.3秒毎に1回のみ発動可能。"
    },
    // 路地遊侠（ダークアレイの閃光）
    "Itinerant Hero": {
      desc: "キャラクターが与えるダメージ+12/15/18/21/24%。ダメージを受けると、このダメージアップ効果は5秒間無効になる。"
    },
    // 「正義」（黒剣）
    "Justice": {
      desc: "通常攻撃と重撃ダメージ+20/25/30/35/40%。さらに通常攻撃と重撃が会心時、攻撃力の60/70/80/90/100%分のHPを回復する。5秒に1回のみ発動可能。"
    },
    // 和音（笛の剣）
    "Chord": {
      desc: "通常攻撃または重撃が命中すると、100%の確率で和音を1個獲得する。和音を5個集めると、音律の力を放ち、周囲の敵に攻撃力の100/125/150/175/200%のダメージを与える。和音は最大30秒存在し、0.5秒毎に最大1個獲得可能。"
    },
    // 降世（降臨の剣）
    "Descension": {
      desc: "通常攻撃と重撃が命中時、50%の確率で攻撃力の200%の狭範囲ダメージを与える。10秒毎に1回のみ発動可能。旅人が降臨の剣を装備すると、さらに攻撃力+66。"
    },

    // 一心不乱（アモスの弓）
    "Strong-Willed": {
      desc: "通常攻撃と狙い撃ちのダメージ+12/15/18/21/24%。矢を放った後、0.1秒後にダメージ+8/10/12/14/16%、最大5回まで上昇する。"
    },
    // 天に響く詩（天空の翼）
    "Echoing Ballad": {
      desc: "会心ダメージ+20/25/30/35/40%。攻撃が命中した時、60/70/80/90/100%の確率で狭範囲内の敵に攻撃力の125%の物理ダメージを与える。4/3.5/3/2.5/2秒毎に1回のみ発動可能。"
    },
    // 追憶と別れの歌（終焉を嘆く詩）
    "The Parting Refrain": {
      desc: "風と共に流れる｢千年の大楽章｣の一部。元素熟知+60/75/90/105/120。元素スキルまたは元素爆発が敵に命中すると、追憶の欠片を一枚獲得する。この効果は0.2秒毎に一回のみ発動でき、待機中のキャラクターも発動できる。追憶の欠片を4枚集めると、全ての追憶の欠片を消費し、周囲のチーム全員に12秒継続する｢千年の大楽章・別れの歌｣効果を付与する: 元素熟知+100/125/150/175/200、攻撃力+20/25/30/35/40%。発動後の20秒間、追憶の欠片を再度獲得することはできない。｢千年の大楽章｣のもたらす各効果中、同種類の効果は重ね掛け不可。"
    },

    // 果てしない恵み（四風原典）
    "Boundless Blessing": {
      desc: "移動速度+10%。フィールドにいる時、4秒毎に元素ダメージ+8/10/12/14/16%、最大4重まで。キャラが退場または戦闘不能まで有効。"
    },
    // 四方浮遊する霊雲（天空の巻）
    "Wandering Clouds": {
      desc: "元素ダメージ+12/15/18/21/24%。通常攻撃が命中した時、50%の確率で高天流雲の好意を獲得し、15秒以内に自分から周囲の敵を攻撃すると、攻撃力の160/200/240/280/320%相当のダメージを与える。30秒毎に1回のみ発動可能。"
    },
    // 金璋君臨（浮世の錠）
    "Golden Majesty": {
      desc: "シールド強化+20/25/30/35/40%。攻撃が命中した8秒間、攻撃力+4/5/6/7/8%。この効果は最大5重まで、0.3秒毎に1回のみ発動可能。また、シールド状態の時、攻撃力アップの効果量は2倍になる。"
    },

    // 晴れ空を裂く龍の骨（天空の傲）
    "Sky-Ripping Dragon Spine": {
      desc: "与えるダメージ+8/10/12/14/16%。元素爆発を発動した後、通常攻撃と重撃が命中すると真空の刃を放ち、経路上の敵に攻撃力の80/100/120/140/160%のダメージを与える、継続時間20秒または真空の刃を8回発動するまで。"
    },
    // 狼のような狩人（狼の末路）
    "Wolfish Tracker": {
      desc: "攻撃力+20/25/30/35/40%。HPが30%以下の敵に命中すると、チーム全員の攻撃力+40/50/60/70/80%、継続時間12秒。30秒に1回のみ発動可能。"
    },

    // "Rainbow-Piercing Stinger": {
    //   desc: null
    // },
    // 正義を貫く鳶の槍（和璞鳶）
    "Eagle Spear of Justice": {
      desc: "敵に命中した時、自身の攻撃力+3.2/3.9/4.6/5.3/6%、継続時間6秒、最大7重まで。0.3秒に1回のみ発動できる。7重まで発動すると与えるダメージ+12/15/18/21/24%。"
    },
    // 黒翼を切り裂く鋭牙（天空の脊）
    "Black Wing": {
      desc: "会心率+8/10/12/14/16%、通常攻撃速度+12%。通常攻撃と重撃が命中時、50%の確率で真空刃を発動し、攻撃力の40/55/70/85/100%の狭範囲ダメージを与える。2秒毎に1回のみ発動可能。"
    },
    // 縛り無き朱色の蝶（護摩の杖）
    "Reckless Cinnabar": {
      desc: "HP上限+20/25/30/35/40%。また、キャラクターのHP上限の0.8/1/1.2/1.4/1.6%分、攻撃力がアップする。キャラクターのHPが50%未満の時、攻撃力が更にHP上限の1/1.2/1.4/1.6/1.8%分アップする。"
    },

    // 西風の鷹の抗い（風鷹剣）
    "Falcons Defiance": {
      desc: "攻撃力+20/25/30/35/40%。ダメージを受けると発動。抗争の旗を高く掲げる西風の鷹が蘇り、攻撃力の100/115/130/145/160%分のHPを回復し、周りの敵に攻撃力の200/230/260/290/320%のダメージを与える。15秒ごとに1回発動可能。"
    },
    // 高天を貫く牙（天空の刃）
    "Sky-Piercing Fang": {
      desc: "会心率+4/5/6/7/8%。元素爆発を使用すると衝天の勢いを獲得する: 移動速度+10%、攻撃速度+10%、通常攻撃と重撃が命中する際に、攻撃力の20/25/30/35/40%の追加ダメージを与える、継続時間12秒。"
    },
    // 護国の無垢なる心（磐岩結緑）
    "Protectors Virtue": {
      desc: "HP上限+20/25/30/35/40%。また、キャラクターのHP上限の1.2/1.5/1.8/2.1/2.4%分、攻撃力がアップする。"
    },

    // 底なしの渇望（腐植の剣）
    "Undying Admiration": {
      desc: "元素スキルのダメージ+16/20/24/28/32%、元素スキルの会心率+6/7.5/9/10.5/12%"
    },
    // 霜の埋葬（冬忍びの実、雪葬の星銀、ドラゴンスピア）
    "Frost Burial": {
      desc: "通常攻撃と重撃が敵に命中した時、60/70/80/90/100%の確率で敵の上に恒氷晶核が作られ落下し、攻撃力の80/95/110/125/140%の範囲ダメージを与える。敵が氷元素の影響を受けている場合、攻撃力の200/240/280/320/360%のダメージを与える。この効果は10秒毎に1回のみ発動可能。"
    },
  },

  artifactData: {
    "Adventurer"      : "冒険者",
    "Lucky Dog"       : "幸運",
    "Traveling Doctor": "医者",

    "Instructor": "教官",
    "Berserker" : "狂戦士",
    "The Exile" : "亡命者",

    "Resolution of Sojourner": "旅人の心",
    "Martial Artist"         : "武人",
    "Defenders Will"         : "守護の心",
    "Tiny Miracle"           : "奇跡",
    "Brave Heart"            : "勇士の心",
    "Gambler"                : "博徒",
    "Scholar"                : "学者",

    "Gladiators Finale": "剣闘士のフィナーレ",
    "Wanderers Troupe" : "大地を流浪する楽団",

    "Maiden Beloved"         : "愛される少女",
    "Noblesse Oblige"        : "旧貴族のしつけ",
    "Bloodstained Chivalry"  : "血染めの騎士道",
    "Viridescent Venerer"    : "翠緑の影",
    "Thundering Fury"        : "雷のような怒り",
    "Thundersoother"         : "雷を鎮める尊者",
    "Crimson Witch of Flames": "燃え盛る炎の魔女",
    "Lavawalker"             : "烈火を渡る尊者",
    "Archaic Petra"          : "悠久の磐岩",
    "Retracing Bolide"       : "逆飛びの流星",

    "Glacier and Snowfield": "Glacier and Snowfield",
    "Icebreaker"           : "Icebreaker",
    "Blizzard Strayer"     : "氷風を彷徨う勇士",
    "Heart of Depth"       : "沈淪の心",

    "Prayers for Wisdom"      : "雷祭りの人",
    "Prayers to Springtime"   : "氷祭りの人",
    "Prayers for Illumination": "火祭りの人",
    "Prayers for Destiny"     : "水祭りの人"
  },

  artifactSetData: {
    // 冒険者
    "Adventurer": [
      ,
      {desc: "HP上限+1000。"},
      ,
      {desc: "宝箱を受けた後5秒間、HPの30%を徐々に回復する。"}
    ],
    // 幸運
    "Lucky Dog": [
      ,
      {desc: "防御力+100。"},
      ,
      {desc: "モラを拾得すると、HPを300回復する。"}
    ],
    // 医者
    "Traveling Doctor": [
      ,
      {desc: "受ける治療効果+20%。"},
      ,
      {desc: "元素爆発を発動すると、HPを20%回復する。"}
    ],
    // 教官
    "Instructor": [
      ,
      {desc: "元素熟知+80。"},
      ,
      {desc: "元素反応を引き起こした後、チーム全員の元素熟知+120、継続時間8秒。"}
    ],
    // 狂戦士
    "Berserker": [
      ,
      {desc: "会心率+12%。"},
      ,
      {desc: "HPが70%以下になると、会心率+24%。"}
    ],
    // 亡命者
    "The Exile": [
      ,
      {desc: "元素チャージ効率+20%。"},
      ,
      {desc: "元素爆発を発動すると、2秒毎にチーム全員(自分を除く)の元素エネルギーを2回復する、継続時間6秒。重ね掛け不可。"}
    ],
    // 旅人の心
    "Resolution of Sojourner": [
      ,
      {desc: "攻撃力+18%。"},
      ,
      {desc: "重撃の会心率+30%。"}
    ],
    // 武人
    "Martial Artist": [
      ,
      {desc: "通常攻撃と重撃のダメージ+15%。"},
      ,
      {desc: "元素スキル発動後、通常攻撃と重撃ダメージ+25%、継続時間8秒。"}
    ],
    // 守護の心
    "Defenders Will": [
      ,
      {desc: "防御力+30%。"},
      ,
      {
        desc  : "チーム内の自身のキャラクターの元素タイプ1種類につき、自身にその元素の耐性+30%。",
        select: [
          {option: "炎元素耐性アップ"},
          {option: "水元素耐性アップ"},
          {option: "草元素耐性アップ"},
          {option: "雷元素耐性アップ"},
          {option: "風元素耐性アップ"},
          {option: "氷元素耐性アップ"},
          {option: "岩元素耐性アップ"}
        ]
      }
    ],
    // 奇跡
    "Tiny Miracle": [
      ,
      {desc: "全ての元素耐性+20%。"},
      ,
      {desc: "元素ダメージを受けると、その元素の耐性+30%、継続時間10秒。10秒毎に1回のみ発動可能。"}
    ],
    // 勇士の心
    "Brave Heart": [
      ,
      {desc: "攻撃力+18%。"},
      ,
      {desc: "HPが50%以上の敵に対するダメージ+30%。"}
    ],
    // 博徒
    "Gambler": [
      ,
      {desc: "元素スキルのダメージ+20%。"},
      ,
      {desc: "敵を倒した時、100%の確率で元素スキルのクールタイムをリセットする。15秒に1回のみ発動可能。"}
    ],
    // 学者
    "Scholar": [
      ,
      {desc: "元素チャージ効率+20%。"},
      ,
      {desc: "元素オーブまたは元素粒子を獲得した時、チーム内全ての弓と法器キャラの元素エネルギーが3回復する。3秒毎に1回のみ発動可能。"}
    ],
    // 剣闘士のフィナーレ
    "Gladiators Finale": [
      ,
      {desc: "攻撃力+18%。"},
      ,
      {desc: "該当聖遺物セットを装備したキャラが片手剣、両手剣、長柄武器キャラの場合、通常攻撃ダメージ+35%。"}
    ],
    // 愛される少女
    "Maiden Beloved": [
      ,
      {desc: "与える治癒効果+15%。"},
      ,
      {desc: "元素スキルまたは元素爆発を発動した後10秒間、チーム全員の受ける治療効果+20%。"}
    ],
    // 旧貴族のしつけ
    "Noblesse Oblige": [
      ,
      {desc: "元素爆発のダメージ+20%。"},
      ,
      {desc: "元素爆発を発動すると、チーム全員の攻撃力+20%、継続時間12秒、重ねがけ不可。"}
    ],
    // 血染めの騎士道
    "Bloodstained Chivalry": [
      ,
      {desc: "物理ダメージ+25%。"},
      ,
      {desc: "敵を倒した後の10秒間、重撃の際にスタミナを消耗しない、また、重撃のダメージ+50%。"}
    ],
    // 大地を流浪する楽団
    "Wanderers Troupe": [
      ,
      {desc: "元素熟知+80。"},
      ,
      {desc: "該当聖遺物セットを装備したキャラが法器、弓キャラの場合、キャラの重撃ダメージ+35%。"}
    ],
    // 翠緑の影
    "Viridescent Venerer": [
      ,
      {desc: "風元素ダメージ+15%。"},
      ,
      {desc: "拡散反応によるダメージ+60%。拡散された元素タイプを基準に、影響を受けた敵の元素耐性ｰ40%、継続時間10秒。"}
    ],
    // // 雷のような怒り
    "Thundering Fury": [
      ,
      {desc: "雷元素ダメージ+15%。"},
      ,
      {desc: "過負荷、感電、超電導反応によるダメージ+40%。それらの元素反応を起こすと、元素スキルのクールタイム-1秒。0.8秒毎に最大1回のみ発動可能。"}
    ],
    // 雷を鎮める尊者
    "Thundersoother": [
      ,
      {desc: "雷元素耐性+40%。"},
      ,
      {desc: "雷元素の影響を受けた敵に対するダメージ+35%。"}
    ],
    // 燃え盛る炎の魔女
    "Crimson Witch of Flames": [
      ,
      {desc: "炎元素ダメージ+15%。"},
      ,
      {
        desc  : "過負荷、燃焼反応によるダメージ+40%。蒸発、溶解反応による加算効果+15%。元素スキルを発動した10秒間、2セットの効果量+50%、最大3重まで。",
        switch: [
          {option: "1重"},
          {option: "2重"},
          {option: "3重"}
        ]
      }
    ],
    // 烈火を渡る尊者
    "Lavawalker": [
      ,
      {desc: "炎元素耐性+40%。"},
      ,
      {desc: "炎元素の影響を受けた敵に対するダメージ+35%。"}
    ],
    // 悠久の磐岩
    "Archaic Petra": [
      ,
      {desc: "岩元素ダメージ+15%。"},
      ,
      {
        desc  : "結晶反応で形成された欠片を獲得すると、チーム全員の該当元素ダメージ+35%、継続時間10秒。元素ダメージアップは同時に1種類のみ獲得可能。",
        switch: [
          {option: "炎元素ダメージアップ"},
          {option: "水元素ダメージアップ"},
          {option: "雷元素ダメージアップ"},
          {option: "氷元素ダメージアップ"}
        ]
      }
    ],
    // 逆飛びの流星
    "Retracing Bolide": [
      ,
      {desc: "シールド強化+35%。"},
      ,
      {desc: "シールド状態の時、通常攻撃と重撃ダメージ+40%。"}
    ],
    // ?
    // "Glacier and Snowfield": [
    //   ,
    //   {desc: null},
    //   ,
    //   {desc: null}
    // ],
    // 沈倫の心
    "Heart of Depth": [
      ,
      {desc: "水元素ダメージ+15%。"},
      ,
      {desc: "元素スキルを発動した後の15秒間、通常攻撃と重撃のダメージ+30%。"}
    ],
    // 氷風を彷徨う勇士
    "Blizzard Strayer": [
      ,
      {desc: "氷元素ダメージ+15%。"},
      ,
      {
        desc  : "氷元素の影響を受けている敵を攻撃した場合、会心率+20%。敵が凍結状態の場合、会心率は更に+20%。",
        switch: [
          {option: 'aaa1'},
          {option: 'aaa2'}
        ]
      }
    ],
    // ?
    // "Icebreaker": [
    //   ,
    //   {desc: null},
    //   ,
    //   {desc: null}
    // ],
    // 雷祭りの人
    "Prayers for Wisdom": [
      {
        desc: "受けた雷元素付着の効果継続時間ｰ40%。"
      }
    ],
    // 氷祭りの人
    "Prayers to Springtime": [
      {
        desc: "受けた氷元素付着の効果継続時間ｰ40%。"
      }
    ],
    // 火祭りの人
    "Prayers for Illumination": [
      {
        desc: "キャラが受けた炎元素付着の効果継続時間ｰ40%。"
      }
    ],
    // 水祭りの人
    "Prayers for Destiny": [
      {
        desc: "受けた水元素付着の効果継続時間ｰ40%。"
      }
    ]
  },

  resonanceData: {
    "Enduring Rock"    : {
      name: "不動の岩",
      desc: "シールド強化+15%。また、キャラクターがシールド状態の時、以下の効果を得る: 与えるダメージ+15%。敵にダメージを与えた時、敵の岩元素耐性-20%、継続時間15秒。"
    },
    "Fervent Flames"   : {
      name: "熱誠の炎",
      desc: "氷元素付着の効果継続時間-40%。攻撃力+25%。"
    },
    "Soothing Waters"  : {
      name: "治療の水",
      desc: "炎元素付着の継続時間-40%。受ける治療効果+30%。"
    },
    "Impetuous Winds"  : {
      name: "迅速の風",
      desc: "スタミナ消費-15%、移動速度+10%、スキルのクールタイム-5%。"
    },
    "High Voltage"     : {
      name: "強権の雷",
      desc: "水元素付着の継続時間-40%。超電導、過負荷または感電反応を起こした時、100%の確率で雷元素粒子を生成する、クールタイム5秒。"
    },
    "Shattering Ice"   : {
      name: "粉砕の氷",
      desc: "雷元素付着の継続時間-40%。氷元素付着または凍結状態の敵を攻撃する時、会心率+15%。"
    },
    "Protective Canopy": {
      name: "交錯の守り",
      desc: "全元素耐性+15%、物理耐性+15%。"
    }
  },

  partyData: {
    //Elemental Reactions
    // 超電導
    "Superconduct": [
      {
        desc: "敵の物理耐性-40%。"
      }
    ],

    //Character Skills
    // 北斗
    "Beidou": [
      {
        name: "北斗の祓い",
        desc: "雷斫り継続中、周囲の敵の雷元素耐性-15%。"
      }
    ],
    // ベネット
    "Bennett": [
      {
        name     : "素晴らしい旅",
        desc     : "鼓舞エリア -- エリア内のキャラクターのHPが最大値の70%以上の場合、ベネットの基礎攻撃力を基準に、一定割合の攻撃力がアップする。エリア内のキャラクターに炎元素付着効果を付与する。",
        variables: {
          "Base Attack" : "基礎攻撃力",
          "Talent Level": "天賦 Lv."
        },
        nested   : [
          {
            name: "冒険の憧れ",
            desc: "素晴らしい旅の攻撃力アップ効果のHPによる制限がなくなり、更にベネットの基礎攻撃力の20%に当たる数値を追加する。"
          },
          {
            name: "烈火と勇気",
            desc: "素晴らしい旅エリア内にいる片手剣、両手剣、長柄武器キャラクターの炎元素ダメージ+15%、さらに炎元素付与状態を獲得する。"
          },
        ]
      }
    ],
    // 重雲
    "Chongyun": [
      {
        name  : "霊刃・重華積霜",
        desc  : "重華積霜エリア - エリア内の片手剣、両手剣、長柄武器キャラクターは氷元素付与を獲得する。",
        nested: [
          {
            name: "吐納真定",
            desc: "霊刃・重華積霜エリア内にいる時、片手剣、両手剣、長柄武器キャラクターの通常攻撃と攻撃速度+8%。"
          }
        ]
      },
      {
        name: "追氷剣訣",
        desc: "霊刃・重華積霜エリアが消えた時、自動的に付近の敵を攻撃する霊刃を召喚し、霊刃・重華積霜のスキルダメージ100%分の氷元素範囲ダメージを与える。命中した敵の氷元素耐性-10%、継続時間8秒。"
      }
    ],
    // 辛炎
    "Xinyan": [
      {
        name: "リズムの伝染",
        desc: "情熱の薙ぎ払いの振り回しダメージを受けた敵の物理耐性-15%、継続時間12秒。"
      },
      {
        name: "「…これこそがロックだ!」",
        desc: "情熱の薙ぎ払いのシールドが存在する時、キャラクターが与える物理ダメージ+15%。"
      }
    ],
    // ディオナ
    "Diona": [
      {
        name  : "キャッツテールが閉店の時",
        desc  : "氷気の酒霧エリア -- エリアにいるキャラクターは自身の現在HPによって以下の効果を獲得する:",
        switch: [
          {
            option: "HPが50%以下の時、受ける治療効果+30%。"
          },
          {
            option: "HPが50%より上回る時、元素熟知+200。"
          }
        ]
      }
    ],
    // ジン
    "Jean": [
      {
        name: "人々を守る盾",
        desc: "ジンが元素オーブまたは元素粒子を獲得した時、チームにいる全てのキャラクターの移動速度+15%、攻撃速度+15%、継続時間15秒。"
      },
      {
        name  : "蒲公英の風",
        desc  : "蒲公英エリア -- エリア内にいるキャラクターのHPを継続回復する。エリア内にいるキャラクターは継続的に風元素の影響を受ける。",
        nested: [
          {
            name: "蒲公英の国土",
            desc: "蒲公英の風エリア内、全ての敵の風元素耐性-40%。"
          }
        ]
      }
    ],
    // クレー
    "Klee": [
      {
        name: "弾丸の破片",
        desc: "ボンボン爆弾のブービートラップのダメージを受けた敵の防御力-23%、継続時間10秒"
      },
      {
        name: "火力全開",
        desc: "ドッカン花火状態中、クレーは3秒毎にチーム全員（クレーを除く）の元素エネルギーを3回復する。ドッカン花火発動後25秒間、チーム全員の炎元素ダメージ+10%。"
      }
    ],
    // リサ
    "Lisa": [
      {
        name: "静電気フィールド",
        desc: "薔薇の雷光攻撃を受けた敵の防御力-15%、継続時間10秒。"
      }
    ],
    // モナ
    "Mona": [
      {
        name: "沈没の預言",
        desc: "チーム内の自身のキャラクターの攻撃が星異状態の敵に命中した後の8秒間、水元素の関連反応の効果が上昇する: 感電反応ダメージ+15%、蒸発反応ダメージ+15%、水元素の拡散反応によるダメージ+15%。凍結反応の継続時間+15%。"
      },
      {
        name: "絶滅の預言",
        desc: "チーム内の自身のキャラクターが星異状態の敵を攻撃する時、会心率+15%。"
      },
      {
        name     : "星命定軌",
        desc     : "星異 -- 星異状態継続中、受けるダメージがアップする。",
        variables: {
          "Talent Level": "天賦 Lv."
        }
      }
    ],
    // 凝光
    "Ningguang": [
      {
        name: "神機妙道の陣組み",
        desc: "璇璣屏付近のキャラクターの全元素耐性+10%。"
      },
      {
        name: "備えあれば憂いなし",
        desc: "璇璣屏を突き抜けたキャラクターの岩元素ダメージ+12%、継続時間10秒。"
      }
    ],
    // 七七
    "Qiqi": [
      {
        name: "延命妙法",
        desc: "寒病鬼差 -- 仙法・寒病鬼差状態時のキャラクターが元素反応を起こした時、受ける治療効果+20%、継続時間8秒。"
      }
    ],
    // レザー
    "Razor": [
      {
        name: "噛みつく",
        desc: "鋭い爪と蒼雷 -- 鋭い爪と蒼雷の一回押しで攻撃した時、命中した敵の防御力-15%、継続時間7秒。"
      }
    ],
    // スクロース
    "Sucrose": [
      {
        name  : "混合熵増論",
        desc  : "禁・風霊作成・七五同構弐型に元素変化が起きた時、スキル継続中チーム全員の該当元素ダメージ+20%。",
        switch: [
          {
            option: "炎元素ダメージ+20%"
          },
          {
            option: "水元素ダメージ+20%"
          },
          {
            option: "雷元素ダメージ+20%"
          },
          {
            option: "氷元素ダメージ+20%"
          }
        ]
      },
      {
        name: "触媒置換術",
        desc: "スクロースが拡散反応を起こした時、該当元素のチームメンバー全員（スクロース自身を除く）の元素熟知+50、継続時間8秒。"
      },
      {
        name     : "小さな恵風",
        desc     : "風霊作成・六三〇八又は禁・風霊作成・七五同構弐型が敵に命中した時、スクロースの元素熟知の20%を基準に、チーム全員（スクロース自身を除く）の元素熟知を強化する、継続時間8秒。",
        variables: {
          "Elemental Mastery": "元素熟知"
        }
      }
    ],
    // 旅人（風）
    "Traveler (Anemo)": [
      {
        name  : "もつれる信風",
        desc  : "激風の息によるダメージを受けた目標の風元素耐性-20%。元素変化があった場合､該当の元素耐性-20%。",
        switch: [
          {
            option: "風元素耐性-20%、炎元素耐性-20%"
          },
          {
            option: "風元素耐性-20%、水元素耐性-20%"
          },
          {
            option: "風元素耐性-20%、雷元素耐性-20%"
          },
          {
            option: "風元素耐性-20%、氷元素耐性-20%"
          }
        ]
      }
    ],
    // 旅人（岩）
    "Traveler (Geo)": [
      {
        name: "巍然たる青岩",
        desc: "チーム内キャラクターが岩潮幾重の岩の山に包囲されている時、会心率+10%、中断耐性がアップする。"
      }
    ],
    // ウェンティ
    "Venti": [
      {
        name: "恋い焦がれるそよ風",
        desc: "高天の歌発動後、敵の風元素耐性と物理耐性-12%、継続時間10秒。高天の歌によってノックバックされた敵が着地するまで、風元素耐性と物理耐性が更に-12%。"
      },
      {
        name  : "抗争の暴風",
        desc  : "風神の詩のダメージを受けた敵の風元素耐性-20%。元素変化があった場合、変化した元素の耐性も-20%。",
        switch: [
          {
            option: "風元素耐性-20%、炎元素耐性-20%"
          },
          {
            option: "風元素耐性-20%、水元素耐性-20%"
          },
          {
            option: "風元素耐性-20%、雷元素耐性-20%"
          },
          {
            option: "風元素耐性-20%、氷元素耐性-20%"
          }
        ]
      }
    ],
    // 香菱
    "Xiangling": [
      {
        name: "外カリ中フワ",
        desc: "グゥオパァーに攻撃された敵の炎元素耐性-15%、継続時間6秒。"
      },
      {
        name: "竜巻旋火輪",
        desc: "旋火輪継続中、チーム全員の炎元素ダメージ+15%。"
      },
      {
        name: "激辛唐辛子",
        desc: "グゥオパァー出撃効果終了時、グゥオパァーは消えた位置に唐辛子を残す。唐辛子を拾うと、攻撃力+10%。継続時間10秒。"
      }
    ],
    // アルベド
    "Albedo": [
      {
        name: "ホムンクルスの天智",
        desc: "誕生式・大地の潮を発動した時、付近のチーム内キャラクターの元素熟知を+125、継続時間10秒。"
      },
      {
        name: "無垢なる土",
        desc: "陽華のエリア内にいるフィールド上のキャラクターが、結晶反応で生成されたシールド状態にある時、与えるダメージ+17%。"
      },
      {
        name: "聖なる墜落",
        desc: "陽華のエリア内にいるキャラクターの落下攻撃ダメージ+30%。"
      }
    ],
    // 行秋
    "Xingqiu": [
      {
        name: "青空の虹",
        desc: "古華剣・裁雨留虹の継続時間+3秒。その他、剣雨攻撃を受けた敵の水元素耐性-15%、継続時間4秒。"
      }
    ],
    // バーバラ
    "Barbara": [
      {
        name: "元気溌剌",
        desc: "公演、開始♪のクールタイム-15%。スキル継続中、出場している自身のキャラクターの与える水元素ダメージ+15%。"
      }
    ],
    // 甘雨
    "Ganyu": [
      {
        name: "飲露",
        desc: "二段チャージ重撃の霜華の矢または霜華満開が命中した時、敵の氷元素耐性-15%。継続時間6秒。命中時に甘雨の元素エネルギーを2回復。二段チャージの重撃による元素エネルギーの回復効果は、1回の重撃で1度のみ発動可能。"
      },
      {
        name: "西狩",
        desc: "降衆天華エリア内、敵の受けるダメージが増加する。受けるダメージの増加量は初期が5%、3秒毎に5%上昇し、最大25%まで上昇する。エリアを出た後、継続時間3秒。"
      }
    ],
    // 鍾離
    "Zhongli": [
      {
        name: "地心",
        desc: "玉璋シールドに守られたキャラクターは、付近範囲内の敵の全元素耐性と物理耐性-20%。この効果は重ねがけ不可。"
      }
    ],
    // アンバー
    "Amber": [
      {
        name: "野火の如く",
        desc: "矢の雨を発動した10秒間、チーム全員の移動速度+15%、攻撃力+15%。"
      }
    ],
    // 胡桃
    "Hutao": [
      {
        name: "蝶隠の時",
        desc: "蝶導来世による冥蝶の舞状態終了後、チーム全員(胡桃自身を除く)の会心率+12%、継続時間8秒。"
      }
    ],

    //Artifacts
    // 教官
    "Instructor": [
      {
        desc: "元素反応を引き起こした後、チーム全員の元素熟知+120、継続時間8秒。"
      }
    ],
    // 愛される少女
    "Maiden Beloved": [
      {
        desc: "元素スキルまたは元素爆発を発動した後10秒間、チーム全員の受ける治療効果+20%。"
      }
    ],
    // 旧貴族のしつけ
    "Noblesse Oblige": [
      {
        desc: "元素爆発を発動すると、チーム全員の攻撃力+20%、継続時間12秒、重ねがけ不可。"
      }
    ],
    // 翠緑の影
    "Viridescent Venerer": [
      {
        desc  : "拡散反応によるダメージ+60%。拡散された元素タイプを基準に、影響を受けた敵の元素耐性ｰ40%、継続時間10秒。",
        switch: [
          {
            option: "炎元素耐性ｰ40%"
          },
          {
            option: "水元素耐性ｰ40%"
          },
          {
            option: "雷元素耐性ｰ40%"
          },
          {
            option: "氷元素耐性ｰ40%"
          }
        ]
      }
    ],
    // 悠久の磐岩
    "Archaic Petra": [
      {
        desc  : "結晶反応で形成された欠片を獲得すると、チーム全員の該当元素ダメージ+35%、継続時間10秒。元素ダメージアップは同時に1種類のみ獲得可能。",
        switch: [
          {
            option: "炎元素ダメージ+35%"
          },
          {
            option: "水元素ダメージ+35%"
          },
          {
            option: "雷元素ダメージ+35%"
          },
          {
            option: "氷元素ダメージ+35%"
          }
        ],
      }
    ],

    //Weapons
    // 伝承（竜殺しの英傑譚）
    "Legacy": [
      {
        desc  : "キャラを切り替えると、次に登場するキャラの攻撃力+24/30/36/42/48%、継続時間10秒。20秒に1回のみ発動可能。",
        switch: [
          {
            option: "攻撃力+24%"
          },
          {
            option: "攻撃力+30%"
          },
          {
            option: "攻撃力+36%"
          },
          {
            option: "攻撃力+42%"
          },
          {
            option: "攻撃力+48%"
          }
        ]
      }
    ],
    // 狼のような狩人（狼の末路）
    "Wolfish Tracker": [
      {
        desc  : "攻撃力+20/25/30/35/40%。HPが30%以下の敵に命中すると、チーム全員の攻撃力+40/50/60/70/80%、継続時間12秒。30秒に1回のみ発動可能。",
        switch: [
          {
            option: "攻撃力+40%"
          },
          {
            option: "攻撃力+50%"
          },
          {
            option: "攻撃力+60%"
          },
          {
            option: "攻撃力+70%"
          },
          {
            option: "攻撃力+80%"
          }
        ]
      }
    ]
  },

  // issue: detailed enemy type not listed (such as pyro/cyro slime)
  enemyData: {
    "Slime"                      : "スライム",
    "Hilichurl"                  : "ヒルチャール",
    "Mitachurl"                  : "ヒルチャール暴徒",
    "Samachurl"                  : "ヒルチャールシャーマン",
    "Stonehide Lawachurl"        : "ヒルチャール・岩兜の王",
    "Ruin Guard"                 : "遺跡守衛",
    "Ruin Hunter"                : "遺跡ハンター",
    "Flower"                     : "トリックフラワー",
    "Flower (Stunned)"           : "トリックフラワー（気絶中)",
    "Fatui Skirmisher"           : "ファデュイ先遣隊",
    "Fatui Skirmisher (Shielded)": "ファデュイ先遣隊（元素シールド）",
    "Fatui Pyro Agent"           : "ファデュイ・デットエージェント",
    "Fatui Electro Cincin Mage"  : "ファデュイ・雷蛍術士",
    "Treasure Hoarder"           : "宝盗団",
    "Geovishap Hatchling"        : "ベビーヴィシャップ・岩",
    "Abyss Mage"                 : "アビスの魔術師",
    "Hypostasis"                 : "無相",
    "Regisvine"                  : " 爆炎樹、急凍樹",
    "Regisvine (Stunned)"        : " 爆炎樹、急凍樹（気絶中）",
    "Dvalin"                     : "トワリン",
    "Andrius"                    : "アンドリアス"
  }
}
